{
  "title": "AWS re:Invent 2025 - How Netflix uses Amazon S3 Storage Lens to track exabytes of data (STG214)",
  "title_cn": "AWS re:Invent 2025 - Netflix 如何使用 Amazon S3 Storage Lens 追踪 EB 级数据 (STG214)",
  "abstract": "From storing media content to machine learning training data, Netflix relies on Amazon S3 to support a wide range of use cases. As data grows exponentially, organizations need tools to understand and optimize their storage footprint. S3 Storage Lens provides organization-wide visibility into storage usage and activity, enabling companies to optimize costs, improve performance, and strengthen data protection. In this session, discover how Netflix uses S3 Storage Lens alongside S3 Inventory and server access logs to optimize their massive data estate. You’ll learn about S3 Storage Lens capabilities including visibility into performance bottlenecks and simplified analysis across billions of prefixes.",
  "abstract_cn": "从存储媒体内容到机器学习训练数据，Netflix 依赖 Amazon S3 来支持各种用例。随着数据呈指数级增长，组织需要工具来了解和优化其存储占用空间。S3 Storage Lens 提供组织范围内的存储使用情况和活动可见性，使公司能够优化成本、提高性能并加强数据保护。在本次会议中，了解 Netflix 如何将 S3 Storage Lens 与 S3 Inventory 和服务器访问日志结合使用来优化其海量数据资产。您将了解 S3 Storage Lens 的功能，包括洞察性能瓶颈以及跨数十亿前缀的简化分析。",
  "presenter": [
    {
      "name": "Christie Lee",
      "title": "Principal Solutions Architect",
      "company": "Amazon Web Services"
    },
    {
      "name": "Roshan Thekkekunnel",
      "title": "Product Manager",
      "company": "AWS"
    },
    {
      "name": "Austen Keene",
      "title": "Software Engineer",
      "company": "Netflix"
    },
    {
      "name": "Bi Ling Wu",
      "title": "Data Engineer",
      "company": "Netflix"
    }
  ],
  "attributes": {
    "topic": "Storage",
    "area_of_interest": [
      "Business Intelligence",
      "Monitoring & Observability",
      "Cost Optimization"
    ],
    "services": [
      "Amazon Simple Storage Service (Amazon S3)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=Q2YoHfhFuI8",
  "session_code": "STG214"
}