{
  "title": "AWS re:Invent 2025 - Reinventing the Retail Edge with YUM! Brands, AWS & Spectro Cloud (HMC204)",
  "title_cn": "AWS re:Invent 2025 - 与百胜餐饮集团、AWS 和 Spectro Cloud 共同重塑零售边缘计算 (HMC204)",
  "abstract": "Innovation in global restaurants now goes beyond the menu. For YUM! Brands—parent of Taco Bell, KFC, Pizza Hut, and Habit Burger—digital experiences are key to customer satisfaction and operational excellence. But delivering these consistently across thousands of stores demands a new kind of architecture: modular, portable, and built edge-to-cloud.\nIn this joint session, leaders from YUM! Brands, AWS, and Spectro Cloud will share how they’re deploying next-gen edge platforms to support AI/ML workloads, boost uptime, and drive agility. Learn how AWS and Spectro Cloud enable centralized management, and scalable, production-grade infrastructure to bring innovation closer to customers—whether in retail, industrial, or remote settings. This presentation is brought to you by Spectro Cloud, an AWS Partner.",
  "abstract_cn": "全球餐饮业的创新现已超越菜单本身。对于YUM! Brands——塔可钟、肯德基、必胜客和Habit Burger的母公司——数字化体验是客户满意度和卓越运营的关键。但要在数千家门店中持续提供这些体验，需要一种新型架构：模块化、可移植且构建于边缘到云端。\n\n在这场联合会议中，来自YUM! Brands、AWS和Spectro Cloud的领导者将分享他们如何部署下一代边缘平台来支持AI/ML工作负载、提升正常运行时间并推动敏捷性。了解AWS和Spectro Cloud如何实现集中管理以及可扩展的生产级基础设施，将创新更贴近客户——无论是在零售、工业还是偏远环境中。本演讲由AWS合作伙伴Spectro Cloud呈现。",
  "presenter": [
    {
      "name": "Justin Swagler",
      "title": "Worldwide Head of Physical Retail",
      "company": "AWS"
    },
    {
      "name": "Shiv Adhiappan",
      "title": "Vice President, Global Reliability & Engineering Ops",
      "company": "Yum! Brands"
    },
    {
      "name": "Ryan Good",
      "title": "Director Reliability and Platform Engineering",
      "company": "Yum! Brands"
    }
  ],
  "attributes": {
    "topic": "Hybrid Cloud & Multicloud",
    "area_of_interest": [
      "Edge Computing",
      "Cost Optimization",
      "Kubernetes"
    ],
    "services": [
      "Amazon Elastic Kubernetes Service (Amazon EKS)"
    ],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=hIl37Zk1OnE",
  "session_code": "HMC204-S"
}