{
  "title": "AWS re:Invent 2025 - SageMaker HyperPod: Checkpointless & elastic training for AI models (AIM3338)",
  "title_cn": "AWS re:Invent 2025 - SageMaker HyperPod：AI模型的无检查点弹性训练 (AIM3338)",
  "abstract": "Transform your generative AI model development with checkpointless and elastic training on Amazon SageMaker HyperPod. Learn how checkpointless training eliminates costly downtime by automatically recovering from infrastructure faults in minutes instead of hours, using peer-to-peer state transfer without relying on restarting from checkpoints. Discover how elastic training can dynamically expand to claim idle accelerators or gracefully contract when higher-priority tasks need capacity, all without manual intervention. See how these innovations help you maintain forward training momentum despite infrastructure faults or fluctuations in resource availability, helping you scale and accelerate generative AI model development across hundreds to thousands of AI accelerators.",
  "abstract_cn": "使用Amazon SageMaker HyperPod上的无检查点和弹性训练来变革您的生成式AI模型开发。了解无检查点训练如何通过使用点对点状态传输自动从基础设施故障中恢复，在几分钟而非几小时内消除昂贵的停机时间，而无需依赖从检查点重启。探索弹性训练如何动态扩展以占用空闲加速器，或在高优先级任务需要容量时优雅收缩，所有这些都无需人工干预。了解这些创新如何帮助您在基础设施故障或资源可用性波动的情况下保持前向训练动力，帮助您在数百到数千个AI加速器上扩展和加速生成式AI模型开发。",
  "presenter": [
    {
      "name": "Arun Nagarajan",
      "title": "Principal Software Engineer",
      "company": "Amazon.com"
    },
    {
      "name": "Anirudh Viswanathan",
      "title": "Senior Technical Product Manager, Amazon Web Services",
      "company": "Amazon Web Services"
    },
    {
      "name": "Antonio \"Tony\" Ginart",
      "title": "Principal Research Scientist",
      "company": "Salesforce"
    }
  ],
  "attributes": {
    "topic": "Compute",
    "area_of_interest": [
      "Generative AI",
      "Cost Optimization",
      "Machine Learning"
    ],
    "services": [
      "Amazon SageMaker HyperPod"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=r9J10L2K0F4",
  "session_code": "AIM3338",
  "duration_seconds": 3306,
  "duration_minutes": 55.1
}