{
  "title": "AWS re:Invent 2025 - Amazon GameLift Streams Powers Bandai Namco Entertainment's Metaverse (IND394)",
  "title_cn": "AWS re:Invent 2025 - Amazon GameLift Streams 助力万代南梦宫娱乐的元宇宙 (IND394)",
  "abstract": "Bandai Namco Entertainment built their Gundam metaverse into a globally scalable cloud streaming platform using Amazon GameLift Streams, serving 20+ countries with browser-based access. This session explores achieving minimal session startup times and cost efficiency through dynamic capacity management across 6 AWS regions with real-time demand optimization. The presentation covers multi-runtime architecture designed to enable both high-performance metaverse experiences and instant browser-based access, as well as network performance visualization. Additionally, we'll showcase Amazon integration that create immersive shopping experiences within the metaverse, bridging virtual and physical commerce. Attendees will gain insights into dynamic scaling strategies and multi-region deployment.",
  "abstract_cn": "万代南梦宫娱乐使用 Amazon GameLift Streams 将其高达元宇宙构建为全球可扩展的云流媒体平台,通过基于浏览器的访问方式服务于 20 多个国家。本次会议探讨如何通过跨 6 个 AWS 区域的动态容量管理和实时需求优化来实现最短的会话启动时间和成本效益。演讲内容涵盖多运行时架构,该架构旨在同时支持高性能元宇宙体验和即时浏览器访问,以及网络性能可视化。此外,我们还将展示 Amazon 集成,在元宇宙中创造沉浸式购物体验,连接虚拟与实体商务。与会者将深入了解动态扩展策略和多区域部署。",
  "presenter": [
    {
      "name": "Akinori Hiratani",
      "title": "Sr. Cloud Application Architect",
      "company": "Amazon Web Services Japan G.K."
    },
    {
      "name": "Masamichi Tanaka",
      "title": "Sr. Principal Strategic Engagement",
      "company": "AWS"
    },
    {
      "name": "Natsuhiro Maruyama",
      "title": "Associate",
      "company": "Bandai Namco Entertainment Inc."
    },
    {
      "name": "Daisuke Omori",
      "title": "Manager",
      "company": "Bandai Namco Entertainment Inc."
    }
  ],
  "attributes": {
    "topic": "Industry Solutions",
    "area_of_interest": [
      "Innovation & Transformation",
      "Internet of Things",
      "Customer Enablement"
    ],
    "services": [
      "Amazon GameLift"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=fOP_Or2gv8I",
  "session_code": "IND394"
}