{
  "title": "AWS re:Invent 2025-NBA Inside The Game, Powered by AWS - Building the NBA’s New Stats Program-SPF307",
  "title_cn": "AWS re:Invent 2025-NBA 幕后花絮，由 AWS 提供支持 - 构建 NBA 全新统计项目-SPF307",
  "abstract": "The NBA is launching a new advanced stats program, “Inside The Game, Powered by AWS” to bring fans closer to the game of basketball. During every NBA game, billions of data points are captured, such as a player’s scoring performance on every shot, to their skeletal pose location on the court 60 times a second. This data is used in Artificial Intelligence (AI) and Machine Learning (ML) models to create advanced stats and insights that go beyond the usual box score. This session will cover the NBA’s advanced stats platform migration to AWS and how the suite of AI/ML based stats are being developed. It will also cover how the NBA partnered with AWS to build the new “Gravity” Inside The Game stat, which leverages existing NBA advanced stats and a predictive ML model to determine how much a player pulls defense towards them in real-time throughout every offensive possession.",
  "abstract_cn": "NBA正在推出一项新的高级统计项目\"Inside The Game, Powered by AWS\"，旨在让球迷更贴近篮球比赛。在每场NBA比赛中，都会捕获数十亿个数据点，例如球员每次投篮的得分表现，以及他们在球场上每秒60次的骨骼姿态位置。这些数据被用于人工智能(AI)和机器学习(ML)模型中，以创建超越常规技术统计的高级统计数据和洞察。本次会议将涵盖NBA高级统计平台向AWS的迁移，以及如何开发基于AI/ML的统计套件。还将介绍NBA如何与AWS合作构建新的\"Gravity\" Inside The Game统计指标，该指标利用现有的NBA高级统计数据和预测性ML模型，实时确定球员在每次进攻回合中对防守的吸引力。",
  "presenter": [
    {
      "name": "Dashiell Flynn",
      "title": "Principal Sports Consultant",
      "company": "AWS"
    },
    {
      "name": "Ian McKiernan",
      "title": "Lead Product Manager, Stats Platform and Operations",
      "company": "National Basketball Association"
    },
    {
      "name": "Charles Rohlf",
      "title": "Stats Technology Product Development",
      "company": "National Basketball Association"
    }
  ],
  "attributes": {
    "topic": "",
    "area_of_interest": [],
    "services": [],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=K0dqsUVlkks",
  "session_code": "SPF307",
  "duration_seconds": 3114,
  "duration_minutes": 51.9
}