{
  "title": "AWS re:Invent 2025 - How SAS and Freshworks Power Real-Time Personalization at Extreme Scale -DAT201",
  "title_cn": "AWS re:Invent 2025 - SAS 和 Freshworks 如何在极端规模下实现实时个性化 -DAT201",
  "abstract": "Learn how SAS and Freshworks built real-time data infrastructure that satisfies critical scaling requirements – from “big game” traffic spikes to hypergrowth demands. Brian Jones discusses how SAS designed their SAS 360 Match real-time ad decisioning architecture, which combines intelligent decision logic with high-speed delivery pipelines. He covers the architectural choices, including how cloud-native components and horizontally scalable data layers enable sub-second responsiveness, fault tolerance, and campaign optimization at scale. Additionally, Sreedhar Gade shares how Freshworks redesigned their AI-powered business software architecture to support 10X growth while achieving 95% latency reduction and significant cost savings. This presentation is brought to you by ScyllaDB, an AWS Partner.",
  "abstract_cn": "了解SAS和Freshworks如何构建满足关键扩展需求的实时数据基础设施——从\"重大赛事\"流量峰值到超高速增长需求。Brian Jones讨论了SAS如何设计其SAS 360 Match实时广告决策架构，该架构将智能决策逻辑与高速交付管道相结合。他介绍了架构选择，包括云原生组件和水平可扩展数据层如何实现亚秒级响应、容错能力和大规模活动优化。此外，Sreedhar Gade分享了Freshworks如何重新设计其AI驱动的业务软件架构，以支持10倍增长，同时实现95%的延迟降低和显著的成本节约。本演讲由AWS合作伙伴ScyllaDB提供支持。",
  "presenter": [
    {
      "name": "Sreedhar Gade",
      "title": "VP Engineering",
      "company": "Freshworks"
    },
    {
      "name": "Brian Jones",
      "title": "Sr. Manager, Software Development",
      "company": "SAS"
    },
    {
      "name": "Felipe Mendes",
      "title": "Technical Director",
      "company": "ScyllaDB"
    },
    {
      "name": "Prem Kumar Patturaj",
      "title": "Senior Manager",
      "company": "Freshworks"
    }
  ],
  "attributes": {
    "topic": "Databases",
    "area_of_interest": [
      "Event-Driven Architecture",
      "SaaS",
      "Cost Optimization"
    ],
    "services": [
      "Amazon Elastic Compute Cloud (Amazon EC2)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=RScWKQQwCKk",
  "session_code": "DAT201-S"
}