{
  "title": "AWS re:Invent 2025 - Rewriting the Code: Forging the future with AI, Empathy and Change (WOC101)",
  "title_cn": "AWS re:Invent 2025 - 重写代码：用AI、同理心和变革锻造未来 (WOC101)",
  "abstract": "Tech can change the world; empathy ensures it changes for the better. This session examines the critical intersection of generative AI, emotional intelligence, and women's unique role in shaping technology's future. Leaders and change makers are not just participants in the digital revolution—they are architects of more inclusive workplaces, industries, and communities. AWS is at the forefront of this transformation, implementing robust governance frameworks for responsible AI development. Women technologists at AWS are leading initiatives to ensure AI systems are trained on a variety of datasets and incorporate inclusive design principles from the ground up. Participants will gain perspectives on how AI-driven solutions can reduce bias, amplify voices, and create pathways for equitable progress. Let’s rewrite the code! This session is sponsored by Deloitte.",
  "abstract_cn": "技术可以改变世界；同理心确保它向更好的方向改变。本次会议探讨生成式人工智能、情商以及女性在塑造技术未来中的独特角色这一关键交叉点。领导者和变革者不仅仅是数字革命的参与者——她们是更具包容性的工作场所、行业和社区的架构师。AWS处于这一转型的最前沿，实施强大的治理框架以实现负责任的人工智能开发。AWS的女性技术专家正在领导各项举措，以确保人工智能系统在各种数据集上进行训练，并从一开始就纳入包容性设计原则。参与者将获得关于人工智能驱动的解决方案如何减少偏见、放大声音并为公平进步创造途径的见解。让我们重写代码！本次会议由德勤赞助。",
  "presenter": [
    {
      "name": "Sonu Pathak",
      "title": "Pr. Proserve Account Executive",
      "company": "AWS"
    },
    {
      "name": "Shally Stanley",
      "title": "VP Professional Services NAMER",
      "company": "Amazon Web Services"
    },
    {
      "name": "Mackenzie Herzog",
      "title": "VP, Player Performance and Strategic Innovation",
      "company": "NFL"
    },
    {
      "name": "Kavitha Prabhakar",
      "title": "Principal",
      "company": "Deloitte"
    }
  ],
  "attributes": {
    "topic": "",
    "area_of_interest": [
      "Inclusion"
    ],
    "services": [],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=gvz991i9PR4",
  "session_code": "WOC101"
}