{
  "title": "AWS re:Invent 2025 - Resilience of AWS Cloud: Design patterns for availability (ARC310)",
  "title_cn": "AWS re:Invent 2025 - AWS云的弹性：可用性设计模式 (ARC310)",
  "abstract": "Explore how AWS Regions are designed and operated to achieve resilience beyond traditional data centers. Learn key architectural patterns that AWS services use to maintain operations through disruptions. Discover how service teams ensure continuous availability through sophisticated design principles and operational practices. Gain insights into the foundational patterns that enable mission-critical workloads to maintain availability at scale.",
  "abstract_cn": "AWS Regions are architected with multiple isolated Availability Zones (AZs) - typically 3 or more per region - each containing one or more data centers with independent power, cooling, and networking. This multi-AZ design provides fault isolation that goes beyond traditional single data center approaches.\n\nKey Architectural Patterns for Resilience:\n\n• Cell-based Architecture - Services are partitioned into independent cells that limit blast radius. If one cell fails, others continue operating.\n\n• Shuffle Sharding - Customer requests are distributed across a subset of resources rather than all resources, reducing the impact of any single component failure.\n\n• Static Stability - Systems are designed to continue operating even when dependencies fail, using cached data and pre-computed responses.\n\n• Circuit Breakers - Automatic failure detection that stops sending traffic to failing components and routes around them.\n\nService-Level Resilience Patterns:\n\n• Multi-AZ Deployments - Critical services run across multiple AZs with automatic failover (RDS Multi-AZ, ELB, etc.)\n\n• Regional Replication - Data and configurations replicated across regions for disaster recovery (S3 Cross-Region Replication, DynamoDB Global Tables)\n\n• Graceful Degradation - Services maintain core functionality even when non-essential features fail\n\n• Bulkhead Isolation - Resource pools are separated so high load in one area doesn't affect others\n\nOperational Practices:\n\n• Chaos Engineering - Deliberately introducing failures to test system resilience (AWS Fault Injection Simulator)\n\n• Game Days - Regular exercises simulating real-world failure scenarios\n\n• Automated Recovery - Self-healing systems that detect and remediate issues without human intervention\n\n• Continuous Deployment with Rollback - Rapid deployment capabilities with instant rollback mechanisms\n\nFoundational Infrastructure:\n\n• Network Redundancy - Multiple fiber paths between AZs and regions with diverse routing\n\n• Power Independence - Each AZ has independent power sources including backup generators and UPS systems\n\n• Physical Security - Layered security controls and geographic separation\n\nThese patterns enable AWS services to achieve availability targets of 99.99% or higher by assuming failure is inevitable and designing systems that continue operating through disruptions rather than trying to prevent all failures.",
  "presenter": [
    {
      "name": "Rob Charlton",
      "title": "Principal Technologist",
      "company": "Amazon Web Services"
    },
    {
      "name": "Stephen James Martin",
      "title": "Senior Manager Amazon Web Services",
      "company": "Amazon Web Services"
    }
  ],
  "attributes": {
    "topic": "Architecture",
    "area_of_interest": [],
    "services": [],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=x-IAS4_XdPQ",
  "session_code": "ARC310"
}