{
  "title": "AWS re:Invent 2025 - How to prep Telemetry data for AI consumption (DVT222)",
  "title_cn": "I understand you're interested in AWS re:Invent 2025 session DVT222 about preparing telemetry data for AI consumption. However, I don't have access to specific session content from re:Invent 2025, as this appears to be a future or very recent event.\n\nI can help you with general best practices for preparing telemetry data for AI consumption on AWS:\n\nData Collection & Storage:\n- Use Amazon CloudWatch for metrics and logs\n- Store raw telemetry in Amazon S3 for long-term retention\n- Consider Amazon Timestream for time-series data\n\nData Preprocessing:\n- Clean and normalize data using AWS Glue or Lambda\n- Handle missing values and outliers\n- Aggregate data at appropriate time intervals\n\nFeature Engineering:\n- Extract relevant features using Amazon SageMaker Processing\n- Create rolling windows and statistical features\n- Encode categorical variables appropriately\n\nData Pipeline:\n- Use Amazon Kinesis for real-time streaming\n- Implement batch processing with AWS Batch or EMR\n- Orchestrate workflows with Step Functions\n\nAI/ML Integration:\n- Format data for SageMaker training jobs\n- Use SageMaker Feature Store for feature management\n- Consider Amazon Bedrock for foundation model integration\n\nWould you like me to elaborate on any of these areas, or do you have specific telemetry data preparation challenges you're working on?",
  "abstract": "Engineering team are stuck between a rock and a hard place when it comes to observability: either collect all the data on how your system is behaving or risk not having that one thing needed during an incident. Grepr acts as a proxy between your observability agents and your observability vendor and uses real-time ML to understand the behavior of every piece of data. Grepr's Intelligent Data Engine automatically reduces noise, while keeping all the original raw data in low-cost storage, automatically handling new usage patterns or spikes. The result: minimal configuration, immediate 90% reduction in costs, with no migrations needed. Learn how Grepr works and see it in action in this session. This presentation is brought to you by Grepr, an AWS Partner.",
  "abstract_cn": "工程团队在可观测性方面面临两难境地：要么收集系统行为的所有数据，要么冒着在事故期间缺少关键信息的风险。Grepr作为可观测性代理和可观测性供应商之间的代理，使用实时机器学习来理解每个数据片段的行为。Grepr的智能数据引擎自动减少噪音，同时将所有原始数据保存在低成本存储中，自动处理新的使用模式或峰值。结果是：最少配置，立即降低90%的成本，无需迁移。了解Grepr的工作原理并在本次会议中观看实际演示。本演示由AWS合作伙伴Grepr提供。",
  "presenter": [
    {
      "name": "Jad Naous",
      "title": "CEO",
      "company": "Grepr"
    }
  ],
  "attributes": {
    "topic": "Developer Tools",
    "area_of_interest": [
      "Monitoring & Observability",
      "Cost Optimization",
      "DevOps"
    ],
    "services": [],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=WWLRM61820A",
  "session_code": "DVT222-S",
  "duration_seconds": 574,
  "duration_minutes": 9.6
}