{
  "title": "AWS re:Invent 2025 - Amazon S3 Tables architecture, use cases, and best practices (STG334)",
  "title_cn": "AWS re:Invent 2025 - Amazon S3 Tables 架构、使用案例和最佳实践 (STG334)",
  "abstract": "Explore Amazon S3 Tables architecture and latest features that improve data lake performance. Learn proven optimization strategies, automated maintenance capabilities, and simplified security controls that reduce operational overhead while scaling efficiently. Discover how Indeed is actively modernizing their data infrastructure through an ambitious migration of 80 petabytes from Hive to S3 Tables, achieving significant performance gains and cost reductions. Through real-world use cases and architectural deep-dives, understand how S3 Tables transforms analytics workloads from petabyte-scale processing to real-time dashboards and complex ETL pipelines. You'll gain practical knowledge for table design, cost optimization, and performance tuning to accelerate query speeds and reduce infrastructure costs in your data architecture.",
  "abstract_cn": "探索 Amazon S3 Tables 架构和最新功能，了解如何提升数据湖性能。学习经过验证的优化策略、自动化维护能力以及简化的安全控制，在高效扩展的同时降低运营开销。了解 Indeed 如何通过将 80 PB 数据从 Hive 迁移到 S3 Tables 来积极推进其数据基础设施现代化，实现显著的性能提升和成本降低。通过真实用例和架构深度剖析，理解 S3 Tables 如何转变分析工作负载，从 PB 级数据处理到实时仪表板和复杂的 ETL 管道。您将获得表设计、成本优化和性能调优的实用知识，以加快查询速度并降低数据架构中的基础设施成本。",
  "presenter": [
    {
      "name": "Aditya Kalyanakrishnan",
      "title": "Principal Product Manager",
      "company": "Amazon Web Services"
    },
    {
      "name": "Yuri Zarubin",
      "title": "Principal Engineer",
      "company": "AWS"
    },
    {
      "name": "Min Li",
      "title": "Senior Manager, Software Engineering",
      "company": "Indeed"
    }
  ],
  "attributes": {
    "topic": "Storage",
    "area_of_interest": [
      "Open Data",
      "Innovation & Transformation",
      "Machine Learning"
    ],
    "services": [
      "Amazon Simple Storage Service (Amazon S3)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=Pi82g0YGklU",
  "session_code": "STG334"
}