{
  "title": "AWS re:Invent 2025 - Long-Horizon Coding Agents: Complex Software Projects with Claude (AIM3316)",
  "title_cn": "AWS re:Invent 2025 - 长期编码代理：使用 Claude 完成复杂软件项目 (AIM3316)",
  "abstract": "Vibe coding with AI to write functions & fix bugs? Table stakes. Building an agent that architects, implements, tests, and deploys a full application to AWS? That's fundamentally different.\nThis session explores design patterns that enable Claude on AWS Bedrock to achieve \"escape velocity\"—the ability to make sustained, autonomous progress toward production deployment. You'll learn Anthropic's core principles for building agents that can handle full-stack development tasks independently.\nWe'll cover two critical pattern areas. First, state and environment management: how agents orient themselves through scaffolding techniques, structured state management, and version control integration. Second, progress and quality control: incremental development patterns and self-verification loops that ensure reliable outputs.\nSee practical examples, understand failure modes, and learn strategies for building production agentic systems. This presentation is brought to you by Anthropic, an AWS Partner.",
  "abstract_cn": "用AI进行氛围编码来编写函数和修复错误？这只是基本功能。构建一个能够架构、实现、测试并将完整应用程序部署到AWS的智能体？这是根本性的不同。\n\n本次会议探讨了使Claude在AWS Bedrock上实现\"逃逸速度\"的设计模式——即能够朝着生产部署目标持续自主推进的能力。您将学习Anthropic构建能够独立处理全栈开发任务的智能体的核心原则。\n\n我们将涵盖两个关键模式领域。首先是状态和环境管理：智能体如何通过脚手架技术、结构化状态管理和版本控制集成来定位自身。其次是进度和质量控制：增量开发模式和自我验证循环，以确保可靠的输出。\n\n了解实际示例，理解失败模式，并学习构建生产级智能体系统的策略。本演示由AWS合作伙伴Anthropic为您呈现。",
  "presenter": [
    {
      "name": "Alex Notov",
      "title": "Member of Technical Staff",
      "company": "Anthropic"
    },
    {
      "name": "Nadine Yasser",
      "title": "Member of Technical Staff - Applied AI",
      "company": "Anthropic"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Generative AI",
      "Agentic AI",
      "Machine Learning"
    ],
    "services": [
      "Amazon Bedrock"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=GstBm6ywE1Q",
  "session_code": "AIM3316-S"
}