{
  "title": "AWS re:Invent 2025-How Heidi Health is leveraging GenAI to transform the global healthcare industry",
  "title_cn": "I understand you're asking about AWS re:Invent 2025 and Heidi Health's use of GenAI in healthcare. However, I don't have access to specific information about this particular session or presentation from AWS re:Invent 2025.\n\nTo get accurate information about this topic, I'd recommend:\n\n- Checking the official AWS re:Invent 2025 session catalog and recordings\n- Looking at AWS's official blog posts or case studies about Heidi Health\n- Visiting Heidi Health's website or press releases about their AWS partnership\n\nIf you have specific questions about how GenAI can be applied in healthcare or AWS services that support healthcare AI applications, I'd be happy to help with those general topics instead.",
  "abstract": "Heidi Health started building generative AI for healthcare when most regulators were still grappling with what that meant. After pivoting from appointment prep to AI medical scribing with the explosion of Gen AI, the team confronted challenges unique to gen AI startups: validating non-deterministic outputs at scale, selling probabilistic technology to risk-averse hospitals, and navigating compliance frameworks designed for rule-based software. The biggest bottleneck wasn’t engineering, it was finding expert clinicians to evaluate AI-generated clinical notes. This is the story of finding product-market fit, surviving enterprise sales cycles, building scalable AI evaluation, and adapting language models across four continents.",
  "abstract_cn": "海蒂健康在大多数监管机构仍在努力理解生成式AI含义时就开始为医疗保健构建生成式AI。随着生成式AI的爆发，团队从预约准备转向AI医疗记录，面临着生成式AI初创公司独有的挑战：大规模验证非确定性输出、向风险规避的医院销售概率性技术，以及导航为基于规则的软件设计的合规框架。最大的瓶颈不是工程，而是找到专家临床医生来评估AI生成的临床记录。这是关于寻找产品市场契合度、在企业销售周期中生存、构建可扩展AI评估以及在四大洲适应语言模型的故事。",
  "presenter": [
    {
      "name": "Ocha Cakramurti",
      "title": "Senior Software Engineer (DevOps)",
      "company": "Heidi Health"
    },
    {
      "name": "Yu Liu",
      "title": "Co-Founder & CTO",
      "company": "Heidi Health"
    }
  ],
  "attributes": {
    "topic": "",
    "area_of_interest": [],
    "services": [],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=fboYXjGSWJI",
  "session_code": "STP107"
}