{
  "title": "AWS re:Invent 2025 - Lucid Motors: Building an AI-native Finance Function to Power Growth (AIM274)",
  "title_cn": "AWS re:Invent 2025 - Lucid Motors：构建AI原生财务职能以推动增长 (AIM274)",
  "abstract": "Learn how Lucid Motors is transforming its Finance organization by deploying 16 AI and ML use cases in just 10 weeks, placing the company at the forefront of enterprise AI adoption across the automotive industry. Built on AWS, delivered in collaboration with PwC and moving at Sapphire-level speed, this Finance initiative modernizes decision-making and operational intelligence. The session explores how agentic AI is reshaping insight generation and changing how teams work, using AI to amplify human decision-making while preserving human judgment. Attendees will gain practical perspectives on the delivery models that enabled Lucid to scale AI with unprecedented velocity and discipline. See how Lucid is laying the foundation for an AI-first enterprise and redefining the role of Finance within a modern, technology-enabled automaker. This presentation is brought to you by PwC, an AWS Partner.",
  "abstract_cn": "了解 Lucid Motors 如何在短短 10 周内部署 16 个 AI 和 ML 用例来转型其财务组织，使公司处于整个汽车行业企业 AI 采用的最前沿。该财务计划基于 AWS 构建，与 PwC 合作交付，以 Sapphire 级别的速度推进，实现了决策和运营智能的现代化。本次会议探讨了代理式 AI 如何重塑洞察生成并改变团队的工作方式，利用 AI 增强人类决策能力的同时保留人类判断力。与会者将获得关于交付模型的实用见解，这些模型使 Lucid 能够以前所未有的速度和纪律扩展 AI。了解 Lucid 如何为 AI 优先的企业奠定基础，并重新定义财务在现代技术驱动型汽车制造商中的角色。本演示由 AWS 合作伙伴 PwC 提供。",
  "presenter": [
    {
      "name": "Adam Hood",
      "title": "Partner",
      "company": "PwC"
    },
    {
      "name": "Aditya Baheti",
      "title": "Head Business Finance",
      "company": "Lucid Motors"
    },
    {
      "name": "Lori Driscoll",
      "title": "Partner",
      "company": "PwC"
    },
    {
      "name": "Bradford Donaldson",
      "title": "Partner",
      "company": "PwC"
    },
    {
      "name": "Wil Velez",
      "title": "Finance",
      "company": "Lucid Motors"
    }
  ],
  "attributes": {
    "topic": "Industry Solutions",
    "area_of_interest": [
      "Innovation & Transformation",
      "Agentic AI",
      "Customer Enablement"
    ],
    "services": [
      "Amazon Connect",
      "Amazon Lex",
      "AWS Lambda"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=pNaT-oUhpZc",
  "session_code": "AIM274-S"
}