{
  "title": "AWS re:Invent 2025 - Lucid Motors: Building an AI-native Finance Function to Power Growth (AIM274)",
  "title_cn": "AWS re:Invent 2025 - Lucid Motors：构建AI原生财务功能以推动增长 (AIM274)",
  "abstract": "Learn how Lucid Motors is transforming its Finance organization by deploying 16 AI and ML use cases in just 10 weeks, placing the company at the forefront of enterprise AI adoption across the automotive industry. Built on AWS, delivered in collaboration with PwC and moving at Sapphire-level speed, this Finance initiative modernizes decision-making and operational intelligence. The session explores how agentic AI is reshaping insight generation and changing how teams work, using AI to amplify human decision-making while preserving human judgment. Attendees will gain practical perspectives on the delivery models that enabled Lucid to scale AI with unprecedented velocity and discipline. See how Lucid is laying the foundation for an AI-first enterprise and redefining the role of Finance within a modern, technology-enabled automaker. This presentation is brought to you by PwC, an AWS Partner.",
  "abstract_cn": "了解Lucid Motors如何通过在短短10周内部署16个AI和ML用例来转型其财务组织，使公司在整个汽车行业的企业AI采用方面处于前沿地位。该财务计划基于AWS构建，与普华永道合作交付，以蓝宝石级速度推进，实现决策制定和运营智能的现代化。本次会议探讨代理AI如何重塑洞察生成并改变团队工作方式，利用AI增强人类决策制定的同时保持人类判断力。与会者将获得关于交付模式的实用观点，这些模式使Lucid能够以前所未有的速度和纪律扩展AI。了解Lucid如何为AI优先的企业奠定基础，并重新定义财务在现代技术驱动汽车制造商中的角色。本演示由AWS合作伙伴普华永道为您呈现。",
  "presenter": [
    {
      "name": "Adam Hood",
      "title": "Partner",
      "company": "PwC"
    },
    {
      "name": "Aditya Baheti",
      "title": "Head Business Finance",
      "company": "Lucid Motors"
    },
    {
      "name": "Lori Driscoll",
      "title": "Partner",
      "company": "PwC"
    },
    {
      "name": "Bradford Donaldson",
      "title": "Partner",
      "company": "PwC"
    },
    {
      "name": "Wil Velez",
      "title": "Finance",
      "company": "Lucid Motors"
    }
  ],
  "attributes": {
    "topic": "Industry Solutions",
    "area_of_interest": [
      "Innovation & Transformation",
      "Agentic AI",
      "Customer Enablement"
    ],
    "services": [
      "Amazon Connect",
      "Amazon Lex",
      "AWS Lambda"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=pNaT-oUhpZc",
  "session_code": "AIM274-S",
  "duration_seconds": 3421,
  "duration_minutes": 57.0
}