{
  "title": "AWS re:Invent 2025 - Accelerating AI: How Sun Life reduces latency and enhances engagement (IND3320)",
  "title_cn": "AWS re:Invent 2025 - 加速AI：Sun Life如何降低延迟并提升用户参与度 (IND3320)",
  "abstract": "Organizations are aiming to deliver responsive generative AI experiences that can seamlessly scale across enterprise use cases. Learn how Sun Life transformed content creation and workflow orchestration by building Content Assist—a content, scoring, and rewriting solution that can be trained on any brand guidelines, tone, or examples. Sun Life will share their journey from an AWS Lambda and Amazon Bedrock solution to an AWS AppSync powered streaming UI solution with Model Context Protocol (MCP) integration to support use cases, from corporate-wide productivity tools to automated content creation and contact center authentication. Explore implementation patterns for reducing perceived latency and orchestrating multi-agent workflows.",
  "abstract_cn": "企业正致力于提供响应迅速的生成式AI体验，能够在企业用例中无缝扩展。了解Sun Life如何通过构建Content Assist来转变内容创建和工作流编排——这是一个内容、评分和重写解决方案，可以基于任何品牌指南、语调或示例进行训练。Sun Life将分享他们从AWS Lambda和Amazon Bedrock解决方案发展到支持Model Context Protocol (MCP)集成的AWS AppSync驱动流式UI解决方案的历程，以支持从企业级生产力工具到自动化内容创建和联络中心身份验证等用例。探索减少感知延迟和编排多代理工作流的实现模式。",
  "presenter": [
    {
      "name": "Salman Moghal",
      "title": "Principal Delivery Consultant",
      "company": "Amazon Web Services"
    },
    {
      "name": "Robert Chin",
      "title": "Product Owner, GenAI Patterns",
      "company": "Sun Life"
    },
    {
      "name": "Walter Kurzatz",
      "title": "Senior Principal Software Engineer",
      "company": "Sun Life"
    },
    {
      "name": "Dennis Volovic",
      "title": "Director, Enterprise Architecture",
      "company": "Sun Life"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Generative AI",
      "Agentic AI"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon Connect",
      "AWS AppSync"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=ag2EbZu5gUE",
  "session_code": "IND3320",
  "duration_seconds": 3439,
  "duration_minutes": 57.3
}