{
  "title": "AWS re:Invent 2025 - Putting AI at the core of transformation (AIM427)",
  "title_cn": "I understand you're referencing an AWS re:Invent 2025 session titled \"Putting AI at the core of transformation (AIM427)\". However, I don't have access to the specific content or details from that session.\n\nCould you let me know what specific information you're looking for about this session? For example:\n\n- Are you looking for a summary of the key points discussed?\n- Do you need help implementing concepts mentioned in the session?\n- Are you seeking guidance on AI transformation strategies for your organization?\n- Do you have specific technical questions about AWS AI services that might have been covered?\n\nOnce you provide more context about what you'd like to know, I can help you with relevant AWS AI services, best practices for AI transformation, or technical implementation guidance.",
  "abstract": "As enterprises progress on their digital transformation journeys, the next step is to pivot towards an AI-centered approach. This session will explore strategies and best practices for integrating AI responsibly into existing transformation initiatives, ensuring that AI becomes a core component of business processes and decision-making. This presentation is brought to you by Infosys, an AWS Partner.",
  "abstract_cn": "随着企业在数字化转型之路上不断前进，下一步是转向以AI为中心的方法。本次会议将探讨将AI负责任地整合到现有转型计划中的策略和最佳实践，确保AI成为业务流程和决策制定的核心组成部分。本演示由AWS合作伙伴Infosys为您呈现。",
  "presenter": [
    {
      "name": "Srinivasa Gopal Sugavanam",
      "title": "Vice President",
      "company": "Infosys Limited"
    },
    {
      "name": "Keisha Garcia",
      "title": "VP Digital Enterprise Platforms and Systems of Work",
      "company": "BP corporation"
    },
    {
      "name": "Chaitanya Somanchi",
      "title": "Data Science Manager",
      "company": "Citizens Bank"
    },
    {
      "name": "Sada Iyer",
      "title": "SVP, Platform Engineering",
      "company": "Hertz"
    },
    {
      "name": "Krishna Srinivasan",
      "title": "Director - Enterprise Architecture, Cloud and DevOps",
      "company": "United Airlines"
    },
    {
      "name": "Srinivas Upadhyaya",
      "title": "Head of Business Services & Digital Technologies",
      "company": "Transamerica"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Agentic AI"
    ],
    "services": [],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=zU2-cheztP0",
  "session_code": "AIM427-S",
  "duration_seconds": 3354,
  "duration_minutes": 55.9
}