{
  "title": "AWS re:Invent 2025 - Innovations in AWS analytics: Data processing (ANT305)",
  "title_cn": "AWS re:Invent 2025 - AWS 分析创新：数据处理 (ANT305)",
  "abstract": "Explore the latest advancements in AWS Analytics designed to transform your data processing landscape. This session unveils powerful new capabilities across key services, including Amazon EMR for scalable big data processing, AWS Glue for seamless data integration, Amazon Athena for optimized querying, and Amazon Managed Workflows for Apache Airflow (MWAA) for workflow orchestration. Discover how these innovations can supercharge performance, optimize costs, and streamline your data ecosystem. Whether you're looking to enhance scalability, improve data integration, accelerate queries, or refine workflow management, join us to gain actionable insights that will position your organization at the forefront of data processing innovation.",
  "abstract_cn": "探索AWS Analytics的最新进展，旨在转变您的数据处理格局。本次会议揭示了关键服务的强大新功能，包括用于可扩展大数据处理的Amazon EMR、用于无缝数据集成的AWS Glue、用于优化查询的Amazon Athena，以及用于工作流编排的Amazon Managed Workflows for Apache Airflow (MWAA)。了解这些创新如何能够提升性能、优化成本并简化您的数据生态系统。无论您是希望增强可扩展性、改进数据集成、加速查询，还是完善工作流管理，加入我们以获得可操作的洞察，这将使您的组织处于数据处理创新的前沿。",
  "presenter": [
    {
      "name": "Neil Mukerje",
      "title": "Principal Product Manager",
      "company": "Amazon Web Services"
    },
    {
      "name": "Kinshuk Pahare",
      "title": "Head of Product, AWS Analytics",
      "company": "Amazon"
    },
    {
      "name": "Anjali Norwood",
      "title": "Engineering Senior Manager, Big Data Analytics Platform",
      "company": "Netflix Inc"
    }
  ],
  "attributes": {
    "topic": "Analytics",
    "area_of_interest": [
      "Generative AI",
      "Cost Optimization"
    ],
    "services": [
      "Amazon Athena",
      "Amazon EMR",
      "AWS Glue"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=KckSvlJdV_o",
  "session_code": "ANT305",
  "duration_seconds": 2624,
  "duration_minutes": 43.7
}