{
  "title": "AWS re:Invent 2025 - Unleashing Performance: How Intel Xeon 6 on AWS EC2 Is Redefining Compute & TCO",
  "title_cn": "AWS re:Invent 2025 - 释放性能：Intel Xeon 6 在 AWS EC2 上如何重新定义计算与 TCO",
  "abstract": "Join Intel and AWS leadership for an exclusive deep dive into the transformative power of the latest generation of Intel Xeon 6-powered AWS EC2 instances. Discover how these cutting-edge compute platforms are delivering unprecedented performance, scalability, and total cost of ownership (TCO) benefits for enterprises running on AWS.\nThis session will showcase real-world success stories from our top customers who are harnessing the exclusive synergy of Intel and AWS to accelerate innovation, optimize workloads, and unlock new levels of efficiency. From high-performance computing to AI/ML and enterprise applications, learn how the newest EC2 instances are setting a new standard for cloud infrastructure.\nWhether you're a CTO, cloud architect, or business leader, this session will equip you with insights to make smarter infrastructure decisions and stay ahead in a compute-driven world. Join us to unleash to power of compute on your cloud! This presentation is brought to you by Intel, an AWS Partner.",
  "abstract_cn": "加入英特尔和AWS领导团队,深入探讨最新一代基于Intel Xeon 6的AWS EC2实例的变革力量。了解这些尖端计算平台如何为在AWS上运行的企业提供前所未有的性能、可扩展性和总体拥有成本(TCO)优势。\n\n本次会议将展示我们顶级客户的真实成功案例,他们正在利用英特尔和AWS的独特协同效应来加速创新、优化工作负载并释放新的效率水平。从高性能计算到AI/ML和企业应用程序,了解最新的EC2实例如何为云基础设施树立新标准。\n\n无论您是CTO、云架构师还是业务领导者,本次会议都将为您提供洞察,帮助您做出更明智的基础设施决策,并在计算驱动的世界中保持领先。加入我们,在您的云上释放计算的力量!本演示由AWS合作伙伴英特尔为您呈现。",
  "presenter": [
    {
      "name": "Sudeep Sharma",
      "title": "Principal PMT-ES",
      "company": "AWS"
    },
    {
      "name": "Michael Mariani",
      "title": "VP, Team Amazon",
      "company": "Intel"
    }
  ],
  "attributes": {
    "topic": "Migration & Modernization",
    "area_of_interest": [
      "Global Infrastructure",
      "Generative AI",
      "Cost Optimization"
    ],
    "services": [
      "Amazon Elastic Compute Cloud (Amazon EC2)",
      "Amazon Aurora for PostgreSQL",
      "Amazon Elastic VMware Service (EVS)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=DhfN2uX9XqI",
  "session_code": "CMP210-S"
}