{
  "title": "AWS re:Invent 2025 - Reclaiming Clinical Time: How Veradigm Uses AI to Transform Workflows (IND208)",
  "title_cn": "AWS re:Invent 2025 - 重拾临床时间：Veradigm 如何利用 AI 转变工作流程 (IND208)",
  "abstract": "Discover how Veradigm's Practice Fusion EHR leverages AWS' purpose-built Healthcare AI services—AWS HealthLake, AWS HealthScribe, and Amazon Bedrock—to reduce administrative burden and reclaim valuable clinical time. This session highlights a real-world implementation where ambient clinical documentation powered by AWS HealthScribe seamlessly integrates with AWS HealthLake FHIR datastore and Amazon Bedrock's generative AI capabilities to streamline workflows at the point of care. Learn how these integrated healthcare AI solutions enable health tech organizations to accelerate patient care innovation by eliminating the complexity of building and maintaining foundational data and AI infrastructure.",
  "abstract_cn": "了解 Veradigm 的 Practice Fusion EHR 如何利用 AWS 专为医疗保健打造的 AI 服务——AWS HealthLake、AWS HealthScribe 和 Amazon Bedrock——来减轻行政负担并收回宝贵的临床时间。本次会议重点介绍了一个真实案例实施，其中由 AWS HealthScribe 支持的环境临床文档与 AWS HealthLake FHIR 数据存储和 Amazon Bedrock 的生成式 AI 能力无缝集成，以简化护理点的工作流程。了解这些集成的医疗保健 AI 解决方案如何通过消除构建和维护基础数据和 AI 基础设施的复杂性，使医疗科技组织能够加速患者护理创新。",
  "presenter": [
    {
      "name": "MIRZA BAIG",
      "title": "Principal Product Manager",
      "company": "Amazon"
    },
    {
      "name": "Himanshu Joshi",
      "title": "Sr. Manager, Product,  Healthcare AI",
      "company": "AWS"
    },
    {
      "name": "Ken Sheppard",
      "title": "VP, Technology",
      "company": "Veradigm"
    }
  ],
  "attributes": {
    "topic": "Migration & Modernization",
    "area_of_interest": [
      "Well-Architected Framework",
      "Automation",
      "Agentic AI"
    ],
    "services": [
      "Amazon Bedrock",
      "AWS HealthLake",
      "AWS HealthScribe"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=xCsyVhGAdzM",
  "session_code": "IND208"
}