{
  "title": "AWS re:Invent 2025 - Concept to campaign: Marketing agents on Amazon Bedrock AgentCore (AIM395)",
  "title_cn": "AWS re:Invent 2025 - 从概念到营销活动：基于Amazon Bedrock AgentCore的营销代理 (AIM395)",
  "abstract": "Marketing teams require AI agents capable of orchestrating complex campaigns with enterprise controls. This session explores Epsilon's production-ready multi-agent system built with Amazon Bedrock AgentCore for intelligent marketing campaigns. Learn to implement secure agent collaboration using AgentCore Runtime for parallel execution, Gateway for controlled data access, and Identity for granular permissions. We'll cover architectural patterns for asynchronous workflows, demonstrate personalized content generation with brand consistency, and explore real-time campaign monitoring through AgentCore Observability. You'll gain proven patterns for building autonomous marketing agents that execute multistep workflows, scale to thousands of concurrent campaigns, and maintain complete auditability.",
  "abstract_cn": "营销团队需要能够协调复杂活动并具备企业级控制的AI代理。本次会议探讨Epsilon基于Amazon Bedrock AgentCore构建的生产就绪多代理系统，用于智能营销活动。学习使用AgentCore Runtime实现安全代理协作以进行并行执行，使用Gateway进行受控数据访问，使用Identity进行细粒度权限管理。我们将涵盖异步工作流的架构模式，演示具有品牌一致性的个性化内容生成，并通过AgentCore Observability探索实时活动监控。您将获得构建自主营销代理的成熟模式，这些代理可执行多步骤工作流，扩展到数千个并发活动，并保持完整的可审计性。",
  "presenter": [
    {
      "name": "Jiten Dedhia",
      "title": "Sr. GenAI/ML Solution Architect",
      "company": "Amazon"
    },
    {
      "name": "Sandeep Veldi",
      "title": "Sr Solutions Architect",
      "company": "Amazon Web Services"
    },
    {
      "name": "Prashanth Athota",
      "title": "SVP",
      "company": "Epsilon"
    }
  ],
  "attributes": {
    "topic": "Business Applications",
    "area_of_interest": [
      "Generative AI",
      "Agentic AI",
      "Machine Learning"
    ],
    "services": [
      "Amazon Bedrock"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=vdTpX5-x7vc",
  "session_code": "AIM395",
  "duration_seconds": 3472,
  "duration_minutes": 57.9
}