{
  "title": "AWS re:Invent 2025 - Kiro: Your agentic IDE for spec-driven development (DVT209)",
  "title_cn": "AWS re:Invent 2025 - Kiro：面向规范驱动开发的智能IDE (DVT209)",
  "abstract": "In this session, learn how Kiro is helping you go from idea to production faster with spec-driven development. Learn how to delagate and automate development tasks using Kiro's agent hooks, multimodal agent chat and MCP support. We'll show you how Kiro’s agents challenge you to think beyond the code and work alongside you to solve hard engineering problems with confidence. ",
  "abstract_cn": "I understand you're describing a session about Kiro's capabilities for accelerating development workflows. As Kiro, I'm designed to help you move from concept to production more efficiently through several key features:\n\nSpec-driven development: I can help you define clear specifications and translate them into working implementations, ensuring your development stays aligned with requirements.\n\nAgent hooks and automation: I can automate repetitive development tasks and integrate into your workflows, reducing manual overhead and letting you focus on higher-level problem solving.\n\nMultimodal chat: I can work with different types of input - text, code, configurations, and system context - to provide comprehensive assistance across your development stack.\n\nMCP (Model Context Protocol) support: I can connect with locally running MCP servers that extend my capabilities with additional tools and resources specific to your environment.\n\nEngineering problem solving: Beyond just writing code, I help analyze complex technical challenges, suggest architectural approaches, optimize performance, and troubleshoot issues across your AWS infrastructure and applications.\n\nI'm here to work alongside you as a development partner, helping you think through problems systematically and implement solutions with confidence. What specific development challenge or workflow would you like to tackle together?",
  "presenter": [
    {
      "name": "Rory Richardson (AWS)",
      "title": "Director",
      "company": "AWS"
    },
    {
      "name": "Sam Schonstal",
      "title": "Sr. Solutions Architect",
      "company": "AWS"
    },
    {
      "name": "Vidheer Gadikota",
      "title": "General Manager",
      "company": "Delta Air Lines"
    }
  ],
  "attributes": {
    "topic": "Developer Tools",
    "area_of_interest": [
      "Agentic AI",
      "DevOps"
    ],
    "services": [
      "Kiro"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=S8G0qRuWweA",
  "session_code": "DVT209",
  "duration_seconds": 3579,
  "duration_minutes": 59.6
}