{
  "title": "AWS re:Invent 2025 - Multi-Region disaster recovery & resilience testing (feat. Fidelity) (COP358)",
  "title_cn": "AWS re:Invent 2025 - 多区域灾难恢复与韧性测试（特邀嘉宾：富达投资）(COP358)",
  "abstract": "Explore how AWS innovations are revolutionizing disaster recovery (DR) strategies for enterprise-scale organizations. Managing thousands of applications across AWS Regions demands sophisticated DR capabilities that have historically required complex and resource-intensive custom development. Learn how Fidelity transformed DR for 8,500 mission-critical applications by using the multi-Region recovery orchestration, live dashboards, and reporting capabilities of Amazon Application Recovery Controller's Region switch feature. Combined with AWS Fault Injection Service, Fidelity also validates their recovery procedures under realistic conditions to bolster confidence in their DR plan. Discover how AWS enables enterprises to modernize their infrastructure operations, improve compliance, and enhance business continuity for mission-critical applications.",
  "abstract_cn": "探索AWS创新如何彻底改变企业级组织的灾难恢复(DR)策略。跨AWS区域管理数千个应用程序需要复杂的DR能力,而这在历史上需要复杂且资源密集的自定义开发。了解富达如何通过使用Amazon Application Recovery Controller的区域切换功能的多区域恢复编排、实时仪表板和报告能力,为8,500个关键任务应用程序转型DR。结合AWS Fault Injection Service,富达还在真实条件下验证其恢复程序,以增强对其DR计划的信心。探索AWS如何使企业能够实现基础设施运营现代化、改善合规性并增强关键任务应用程序的业务连续性。",
  "presenter": [
    {
      "name": "John Formento",
      "title": "Principal Product Manager",
      "company": "Amazon Web Services"
    },
    {
      "name": "Shataksh Sharma",
      "title": "Principal Technical Account Manager",
      "company": "Amazon Web Services"
    },
    {
      "name": "Heinz Ludwig",
      "title": "Vice President, Site Reliability Engineering",
      "company": "Fidelity Investments"
    }
  ],
  "attributes": {
    "topic": "Cloud Operations",
    "area_of_interest": [
      "Resilience"
    ],
    "services": [
      "AWS Fault Injection Service",
      "Amazon Application Recovery Controller"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=jZIaliFsPIw",
  "session_code": "COP358"
}