{
  "title": "AWS re:Invent 2025 - Building AI That Customers Actually Trust (AIM2203)",
  "title_cn": "I understand you're referencing an AWS re:Invent 2025 session about building trustworthy AI. However, I don't have access to the specific content or details from that particular session (AIM2203).\n\nIf you have specific questions about building trustworthy AI systems on AWS, I can help with:\n\n- AWS AI/ML services that support responsible AI practices\n- Implementation of AI governance and monitoring\n- Best practices for AI model transparency and explainability\n- Security and privacy considerations for AI workloads\n- Compliance frameworks for AI systems\n\nWhat specific aspect of building trustworthy AI would you like to discuss or implement?",
  "abstract": "AI faces a trust crisis: executives see poor returns while customers find no value in AI-powered customer service and increasingly distrust companies with their data. For product teams navigating boardroom pressure and customer backlash, this creates an urgent challenge. Trust is the currency of AI innovation. This session reveals Qualtrics' playbook for converting AI skeptics into advocates, covering the customer insights that predict AI success and when feedback becomes competitive advantage. Discover where leading companies achieve measurable AI value in customer experience, learn security-first frameworks that build customer confidence, and gain insights from companies successfully building value with AI agents. This presentation is brought to you by Qualtrics, an AWS Partner.",
  "abstract_cn": "人工智能面临信任危机：高管们看到糟糕的投资回报，而客户在AI驱动的客户服务中找不到价值，并且越来越不信任公司处理他们的数据。对于面临董事会压力和客户反弹的产品团队来说，这构成了紧迫的挑战。信任是AI创新的货币。本次会议揭示了Qualtrics将AI怀疑者转化为支持者的策略手册，涵盖预测AI成功的客户洞察以及反馈何时成为竞争优势。了解领先公司在客户体验中实现可衡量AI价值的领域，学习构建客户信心的安全优先框架，并获得成功利用AI代理创造价值的公司的见解。本演示由AWS合作伙伴Qualtrics为您呈现。",
  "presenter": [
    {
      "name": "Samantha Snetselaar",
      "title": "Strategic Sales Advisor",
      "company": "Qualtrics"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Culture of Security",
      "Agentic AI"
    ],
    "services": [],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=fA3zzYpaY-Y",
  "session_code": "AIM2203-S",
  "duration_seconds": 973,
  "duration_minutes": 16.2
}