{
  "title": "AWS re:Invent 2025 - What's new with Amazon EBS (STG202)",
  "title_cn": "I understand you're asking about AWS re:Invent 2025 and what's new with Amazon EBS from session STG202. However, I don't have access to current information about AWS re:Invent 2025 sessions or announcements, as my knowledge has a cutoff date and I can't browse the internet for real-time updates.\n\nTo get the most current information about Amazon EBS updates from re:Invent 2025, I'd recommend:\n\n- Checking the official AWS re:Invent website for session recordings and slides\n- Visiting the AWS What's New page (https://aws.amazon.com/new/)\n- Looking at the AWS Storage Blog for detailed announcements\n- Reviewing the session STG202 materials directly if available\n\nIf you have specific questions about Amazon EBS features or need help with EBS configurations, I'd be happy to assist with those based on my existing knowledge of the service.",
  "abstract": "Stay ahead with the cutting-edge capabilities of Amazon's robust block storage solution in Amazon EBS. Join this session for a comprehensive overview of the latest advancements and features in Amazon Elastic Block Store (EBS). Learn about recent performance improvements, cost optimization strategies, new features that enhance data resiliency and storage efficiency, and practical insights for leveraging EBS in modern cloud environments. You will gain a deeper understanding of how to maximize the potential of Amazon EBS for your workloads.",
  "abstract_cn": "通过Amazon强大的块存储解决方案Amazon EBS的前沿功能保持领先。参加本次会议，全面了解Amazon弹性块存储(EBS)的最新进展和功能。了解最新的性能改进、成本优化策略、增强数据弹性和存储效率的新功能，以及在现代云环境中利用EBS的实用见解。您将深入了解如何最大化Amazon EBS在您工作负载中的潜力。",
  "presenter": [
    {
      "name": "Aaron Chen",
      "title": "Principal Product Manager",
      "company": "Amazon Web Services"
    },
    {
      "name": "Sooraj Prasannan",
      "title": "Senior Manager Product Management",
      "company": "Amazon"
    }
  ],
  "attributes": {
    "topic": "Storage",
    "area_of_interest": [
      "Global Infrastructure",
      "Resilience"
    ],
    "services": [
      "Amazon Elastic Block Store (Amazon EBS)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=m6oL4L2QOvk",
  "session_code": "STG202",
  "duration_seconds": 2179,
  "duration_minutes": 36.3
}