{
  "title": "AWS re:Invent 2025 - Maximizing uptime: Itaú’s mission-critical mainframe migration to AWS (IND3304)",
  "title_cn": "AWS re:Invent 2025 - 最大化正常运行时间:Itaú银行关键任务大型机迁移至AWS (IND3304)",
  "abstract": "Dive deep into Itaú Bank's implementation for migrating core banking authorization from mainframe to AWS, targeting 1,000 TPS per account with sub-100ms latency. As one of Latin America's largest banks serving 70 million clients and processing 100 million daily transactions, Itaú will share advanced Amazon DynamoDB optimization strategies, partitioning patterns, and anti-patterns. Learn practical solutions for managing concurrent transactions through exclusive threading models, cell-based architecture with account sharding, and distributed consistency approaches for high-volume financial workloads. We'll examine techniques for maintaining 99.99% uptime while ensuring transaction accuracy and balance consistency, and explore parallel system validation strategies for seamless migration execution.",
  "abstract_cn": "深入探讨Itaú银行将核心银行授权系统从大型机迁移到AWS的实施方案，目标是每个账户达到1,000 TPS，延迟低于100毫秒。作为拉丁美洲最大的银行之一，Itaú服务7000万客户，每日处理1亿笔交易，将分享高级Amazon DynamoDB优化策略、分区模式和反模式。学习通过独占线程模型、基于单元的账户分片架构以及分布式一致性方法来管理并发交易的实用解决方案，以应对高容量金融工作负载。我们将探讨在确保交易准确性和余额一致性的同时维持99.99%正常运行时间的技术，并探索用于无缝迁移执行的并行系统验证策略。",
  "presenter": [
    {
      "name": "Eduardo Bortoluzzi",
      "title": "Sr. Cloud Application Architect",
      "company": "AWS"
    },
    {
      "name": "Edinei Piovesan",
      "title": "Principal Engineer",
      "company": "Itaú Unibanco"
    },
    {
      "name": "Wilson de Oliveira",
      "title": "Head of IT Engineering",
      "company": "Itau Unibanco"
    }
  ],
  "attributes": {
    "topic": "Architecture",
    "area_of_interest": [
      "Resilience",
      "Customer Enablement"
    ],
    "services": [
      "Amazon DynamoDB",
      "Amazon Simple Queue Service (Amazon SQS)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=fCNpnr1aHLQ",
  "session_code": "IND3304"
}