{
  "title": "AWS re:Invent 2025 - Ripple: Building an intelligent, multi-agent system for 24/7 operations-IND3301",
  "title_cn": "AWS re:Invent 2025 - Ripple：构建智能多代理系统实现全天候运营-IND3301",
  "abstract": "Financial institutions face challenges analyzing massive log volumes, requiring hours or days of manual review for critical incidents. Learn how Ripple is building an automated, multi-agent system using Amazon Bedrock AgentCore and the Strands Agents framework to process 30-50GB of daily logs in minutes. Explore architectural patterns for integrating Amazon CloudWatch, AWS Lambda, Amazon S3, and Amazon OpenSearch to correlate log entries with codebase sections. Discover approaches for designing specialized agents that create conversational user interfaces for guided investigations. See how this system transforms blockchain operations and walk away with strategies for implementing a scalable foundation for building multi-agent applications.",
  "abstract_cn": "金融机构在分析海量日志时面临挑战，对关键事件进行人工审查需要数小时甚至数天时间。了解 Ripple 如何使用 Amazon Bedrock AgentCore 和 Strands Agents 框架构建自动化多代理系统，在几分钟内处理每天 30-50GB 的日志。探索集成 Amazon CloudWatch、AWS Lambda、Amazon S3 和 Amazon OpenSearch 的架构模式，将日志条目与代码库部分关联起来。了解设计专业化代理的方法，这些代理可创建对话式用户界面以进行引导式调查。了解该系统如何改变区块链运营，并掌握实施可扩展多代理应用程序基础架构的策略。",
  "presenter": [
    {
      "name": "Aman Tiwari",
      "title": "Solutions Architect",
      "company": "Amazon Web Services, Inc."
    },
    {
      "name": "Vijay Khanna Raviraj",
      "title": "Senior Engineering Manager",
      "company": "Ripple"
    },
    {
      "name": "Hari Vignesh Rajendran",
      "title": "Staff Software Engineer",
      "company": "Ripple"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Blockchain",
      "Generative AI",
      "Agentic AI"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon OpenSearch Service",
      "AWS Lambda"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=DUKUp0AUums",
  "session_code": "IND3301"
}