{
  "title": "AWS re:Invent 2025 - What's new in AWS cost Optimization (COP202)",
  "title_cn": "I don't have access to specific information about AWS re:Invent 2025 sessions, including the \"What's new in AWS Cost Optimization (COP202)\" session you're asking about. Since re:Invent 2025 would be a future event from my knowledge cutoff, I can't provide details about what was announced in that particular session.\n\nFor the most current information about AWS cost optimization announcements and new features, I'd recommend:\n\n- Checking the official AWS re:Invent website and session recordings\n- Reviewing the AWS What's New page (https://aws.amazon.com/new/)\n- Looking at AWS Cost Management and Billing documentation for recent updates\n- Following AWS official blogs and announcements\n\nIf you have specific cost optimization challenges you're working on, I'd be happy to help with current AWS cost optimization tools and best practices like Cost Explorer, AWS Budgets, Savings Plans, or Reserved Instances.",
  "abstract": "Discover the latest advancements in AWS cost optimization strategies and tools designed to help you operate cost-effectively while maintaining high performance. AWS continues to enhance its suite of management tools that monitor resource performance and costs, while providing recommendations for rightsizing and optimizing purchasing decisions. Join us to stay current with the latest best practices and tools for managing your AWS spending efficiently.",
  "abstract_cn": "探索AWS成本优化策略和工具的最新进展，这些工具旨在帮助您在保持高性能的同时实现成本效益运营。AWS持续增强其管理工具套件，监控资源性能和成本，同时为调整规模和优化采购决策提供建议。加入我们，了解管理AWS支出的最新最佳实践和工具。",
  "presenter": [
    {
      "name": "Mary Nachimov",
      "title": "Sr. Technical Product Manager",
      "company": "AWS"
    },
    {
      "name": "Rick Ochs",
      "title": "Senior Manager, AWS Optimization",
      "company": "AWS"
    },
    {
      "name": "Bonnie Firnstahl",
      "title": "IT Manager, FinOps",
      "company": "Delta Air Lines"
    }
  ],
  "attributes": {
    "topic": "Cloud Operations",
    "area_of_interest": [
      "Management & Governance",
      "Cost Optimization"
    ],
    "services": [
      "AWS Billing and Cost Management",
      "AWS Compute Optimizer",
      "AWS Savings Plans"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=R1yO7HwTB9I",
  "session_code": "COP202",
  "duration_seconds": 3250,
  "duration_minutes": 54.2
}