{
  "title": "AWS re:Invent 2025 - Southwest Gas: Agentic AI readiness and SAP modernization (HMC205)",
  "title_cn": "AWS re:Invent 2025 - Southwest Gas：智能体AI就绪性和SAP现代化 (HMC205)",
  "abstract": "How Southwest Gas is laying the foundation for agentic AI using Amazon Bedrock and AWS services. This presentation is brought to you by IBM, an AWS Partner.",
  "abstract_cn": "I understand you're asking about Southwest Gas's implementation of agentic AI using Amazon Bedrock and AWS services. However, I don't have specific details about Southwest Gas's particular implementation or their partnership with IBM in this context.\n\nI can help you understand how organizations typically build agentic AI foundations using Amazon Bedrock and AWS services:\n\nCommon Architecture Components:\n- Amazon Bedrock for foundation model access and fine-tuning\n- AWS Lambda for serverless AI agent orchestration\n- Amazon S3 for data storage and model artifacts\n- Amazon DynamoDB for conversation state management\n- AWS Step Functions for complex AI workflows\n- Amazon API Gateway for agent endpoints\n\nTypical Implementation Patterns:\n- Multi-agent systems using Bedrock's Claude or other models\n- RAG (Retrieval Augmented Generation) with Amazon OpenSearch\n- Agent memory and context management\n- Integration with existing enterprise systems\n\nIf you have specific questions about implementing agentic AI with these AWS services, or if you have access to the actual presentation content you'd like me to help analyze, I'd be happy to provide more targeted guidance.",
  "presenter": [
    {
      "name": "Laxman Challa",
      "title": "Director, Application Services",
      "company": "Southwest Gas Corporation"
    },
    {
      "name": "Pankaj Kumar",
      "title": "Executive Partner at IBM Consulting and AWS Practice Leader for Comms and IND",
      "company": "IBM"
    }
  ],
  "attributes": {
    "topic": "Migration & Modernization",
    "area_of_interest": [
      "Data Protection",
      "Well-Architected Framework",
      "Agentic AI"
    ],
    "services": [],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=GT-LqYflC3I",
  "session_code": "HMC205-S",
  "duration_seconds": 1154,
  "duration_minutes": 19.2
}