{
  "title": "AWS re:Invent 2025 - Accelerating Development and DevSecOps with Amazon Bedrock and Kiro (PEX303)",
  "title_cn": "AWS re:Invent 2025 - 使用 Amazon Bedrock 和 Kiro 加速开发和 DevSecOps (PEX303)",
  "abstract": "Discover how AWS partners are leveraging Amazon Bedrock and Kiro to revolutionize both software architecture design and DevSecOps practices. Through real-world examples, explore powerful patterns that enhance the entire development lifecycle. Learn how to use GenAI to accelerate cloud architecture design processes—generating standardized patterns, optimizing configurations, ensuring compliance, and creating documentation. Explore how to integrate AI capabilities with security scanning tools, automated code generation, CI/CD pipelines, and threat modeling frameworks. This session showcases how AWS partners have implemented these solutions to improve consistency, maintain compliance, and automate security tasks. Bring your questions to this collaborative session.",
  "abstract_cn": "探索AWS合作伙伴如何利用Amazon Bedrock和Kiro来革新软件架构设计和DevSecOps实践。通过真实案例，了解增强整个开发生命周期的强大模式。学习如何使用GenAI加速云架构设计流程——生成标准化模式、优化配置、确保合规性并创建文档。探索如何将AI能力与安全扫描工具、自动化代码生成、CI/CD管道和威胁建模框架集成。本次会议展示AWS合作伙伴如何实施这些解决方案来提高一致性、维护合规性并自动化安全任务。请带着您的问题参加这个协作会议。",
  "presenter": [
    {
      "name": "Fabio Braga de Oliveira",
      "title": "Solutions Architect",
      "company": "Amazon Web Services"
    },
    {
      "name": "Dhana Vadivelan",
      "title": "EMEA Partner Solutions Architecture Leader",
      "company": "AWS"
    },
    {
      "name": "Joris Conijn",
      "title": "AWS Practice CTO",
      "company": "Xebia Nederland BV"
    }
  ],
  "attributes": {
    "topic": "Security & Identity",
    "area_of_interest": [
      "Application Security",
      "Agentic AI",
      "DevOps"
    ],
    "services": [
      "Amazon Q",
      "Amazon Q Business",
      "Amazon Q Developer"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=P2YX43I8GFI",
  "session_code": "PEX303",
  "duration_seconds": 3703,
  "duration_minutes": 61.7
}