{
  "title": "AWS re:Invent 2025 - AI-Driven Design at Scale: Tempo Labs' Move to AWS Bedrock (MAM325)",
  "title_cn": "AWS re:Invent 2025 - 大规模AI驱动设计：Tempo Labs迁移至AWS Bedrock (MAM325)",
  "abstract": "Learn how Tempo Labs migrated production generative AI workloads from OpenAI to Amazon Bedrock, improving scalability, model choice, and security. Through AWS's Migration Acceleration Program (MAP) and generative AI Innovation Center, Tempo built a code-first UI/UX collaboration platform that enables product managers, designers, and engineers to collaborate directly in code—replacing image-based design workflows. This session covers the complete migration journey: model selection and prompt re-optimization, implementing guardrails and evaluation frameworks, plus infrastructure modernization with Kubernetes and data migration. Walk away with practical migration patterns, responsible AI implementation strategies, and proven approaches for building enterprise-grade genAI platforms at scale.",
  "abstract_cn": "了解 Tempo Labs 如何将生产环境的生成式 AI 工作负载从 OpenAI 迁移到 Amazon Bedrock，从而提升可扩展性、模型选择和安全性。通过 AWS 的迁移加速计划 (MAP) 和生成式 AI 创新中心，Tempo 构建了一个代码优先的 UI/UX 协作平台，使产品经理、设计师和工程师能够直接在代码中协作——取代了基于图像的设计工作流程。本次会议涵盖完整的迁移历程：模型选择和提示词重新优化、实施护栏和评估框架，以及使用 Kubernetes 进行基础设施现代化和数据迁移。您将获得实用的迁移模式、负责任的 AI 实施策略，以及构建企业级大规模生成式 AI 平台的成熟方法。",
  "presenter": [
    {
      "name": "Vaidy A.",
      "title": "WW Tech Leader, Migration",
      "company": "Amazon Web Services Inc."
    },
    {
      "name": "Kevin Michael",
      "title": "CEO & Cofounder",
      "company": "Tempo"
    },
    {
      "name": "Brandon Palin",
      "title": "Head of Growth",
      "company": "Tempo Labs Inc."
    }
  ],
  "attributes": {
    "topic": "Migration & Modernization",
    "area_of_interest": [
      "Generative AI",
      "Innovation & Transformation"
    ],
    "services": [
      "Amazon Bedrock"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=xFNz-UdB-Q4",
  "session_code": "MAM325"
}