{
  "title": "AWS re:Invent 2025 - Transforming Integrated Diagnostics: Philips' AI Journey with AWS (IND219)",
  "title_cn": "AWS re:Invent 2025 - 转型综合诊断：飞利浦与AWS的AI之旅 (IND219)",
  "abstract": "Healthcare providers struggle with disconnected patient data sources across diagnostic platforms, hampering clinical decision-making. Philips addresses this through integrated cloud-based solutions in radiology, cardiology, and digital pathology, powered by AI capabilities. As digital pathology emerges as the next innovation frontier, cloud infrastructure becomes crucial for managing massive imaging datasets and enabling collaboration.Incorporating AWS HealthImaging and AWS generative AI tools, Philips has developed comprehensive digital pathology solutions that streamline workflows, enhance diagnostic accuracy, and enables global collaboration. The goal is to improve diagnosis and treatment planning through standardized DICOM implementation, AI-assisted analysis, and seamless data sharing across healthcare institutions worldwide.",
  "abstract_cn": "医疗服务提供者面临着诊断平台间患者数据源分散的困境，这阻碍了临床决策。飞利浦通过在放射学、心脏病学和数字病理学领域提供集成的基于云的解决方案来解决这一问题，这些解决方案由人工智能能力驱动。随着数字病理学成为下一个创新前沿，云基础设施对于管理海量影像数据集和实现协作变得至关重要。结合AWS HealthImaging和AWS生成式人工智能工具，飞利浦开发了全面的数字病理学解决方案，可简化工作流程、提高诊断准确性并实现全球协作。其目标是通过标准化DICOM实施、人工智能辅助分析以及全球医疗机构间的无缝数据共享来改善诊断和治疗规划。",
  "presenter": [
    {
      "name": "Sam Kool",
      "title": "Sr. Solution Architect",
      "company": "Amazon"
    },
    {
      "name": "Jaron Nix",
      "title": "Senior Product Manager, AWS Applied AI Solutions",
      "company": "AWS"
    },
    {
      "name": "Predrag Angelovski",
      "title": "Head of Technology",
      "company": "Philips"
    },
    {
      "name": "Wilson To",
      "title": "VP, Global Strategy & BD",
      "company": "Philips"
    }
  ],
  "attributes": {
    "topic": "Industry Solutions",
    "area_of_interest": [
      "Business Intelligence",
      "Automation",
      "Agentic AI"
    ],
    "services": [
      "AWS HealthImaging"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=y8g9gY9pOzY",
  "session_code": "IND219"
}