{
  "title": "AWS re:Invent 2025 -Fidelity Investments: Text-to-SQL for data analytics at enterprise scale-IND3323",
  "title_cn": "AWS re:Invent 2025 - Fidelity Investments：企业级数据分析的文本转SQL技术 - IND3323",
  "abstract": "Learn how Fidelity Institutional (FI) developed and implemented a sophisticated Text-to-SQL generative AI solution that enables non-technical domain experts to interact with complex structured data using natural language. Dive deep into the architecture and technical implementation details of a system that handles complex database schemas, multiple table relationships, and generates complex SQL queries. We’ll cover advanced topics including natural language understanding optimization, query re-write, vector search, SQL generation strategies, query safety mechanisms, and performance tuning for large-scale structured data operations. Discover the validation frameworks, monitoring systems, and API design patterns that make this solution robust and reusable.",
  "abstract_cn": "了解富达机构(FI)如何开发和实施一个复杂的文本转SQL生成式AI解决方案,使非技术领域专家能够使用自然语言与复杂的结构化数据进行交互。深入探讨该系统的架构和技术实施细节,该系统可处理复杂的数据库模式、多表关系并生成复杂的SQL查询。我们将涵盖高级主题,包括自然语言理解优化、查询重写、向量搜索、SQL生成策略、查询安全机制以及大规模结构化数据操作的性能调优。了解使该解决方案稳健且可重用的验证框架、监控系统和API设计模式。",
  "presenter": [
    {
      "name": "Vikram Elango",
      "title": "Sr. AIML Specialist Solutions Architect",
      "company": "Amazon Web Services"
    },
    {
      "name": "Manish Worlikar",
      "title": "Head of FI Artificial Intelligence CoE",
      "company": "Fidelity Investments"
    },
    {
      "name": "Ray Zhang",
      "title": "VP of AI/ML engineering, Fidelity Institution",
      "company": "Fidelity Investments"
    }
  ],
  "attributes": {
    "topic": "Analytics",
    "area_of_interest": [
      "Generative AI",
      "Kubernetes"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon Elastic Kubernetes Service (Amazon EKS)",
      "Amazon OpenSearch Service"
    ],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=YA7Svfb0ttU",
  "session_code": "IND3323"
}