{
  "title": "AWS re:Invent 2025 - Breaking the legacy barrier: How AI is revolutionizing modernization (MAM402)",
  "title_cn": "AWS re:Invent 2025 - 打破传统壁垒：AI如何革命性地推动现代化改造 (MAM402)",
  "abstract": "Enterprises are trapped by legacy monoliths that drain billions in maintenance while stifling innovation. Traditional event storming relies on fragmented human memory and disappearing institutional knowledge. Learn how AWS GenAI & Agentic AI services  can now reverse-engineer entire codebases, automatically generating comprehensive event storming a& DDD based analysis  that captures bounded context and  hidden business rules and forgotten workflows in legacy applications. This AI-driven approach transforms months of code archaeology into days of systematic analysis. Organizations can modernize confidently, with early adopters reporting faster modernization with less timeline and fewer post-migration defects. Experience how AI precision is revolutionizing enterprise modernization.",
  "abstract_cn": "企业被传统单体架构困扰，耗费数十亿资金进行维护，同时抑制创新。传统事件风暴依赖于碎片化的人类记忆和消失的机构知识。了解AWS GenAI和智能体AI服务如何逆向工程整个代码库，自动生成全面的事件风暴和DDD分析，捕获边界上下文以及遗留应用程序中隐藏的业务规则和被遗忘的工作流程。这种AI驱动的方法将数月的代码考古工作转化为数天的系统性分析。组织可以自信地进行现代化改造，早期采用者报告称现代化速度更快，时间线更短，迁移后缺陷更少。体验AI精准度如何革命性地改变企业现代化进程。",
  "presenter": [
    {
      "name": "Anand Bilgaiyan",
      "title": "Senior Specialist Partner solution Architect Enterprise Transformation",
      "company": "AWS"
    },
    {
      "name": "Sreekumar Nair",
      "title": "Sr Spec SA Migration+Modernize",
      "company": "Amazon Web Services Singapore Private Limited"
    },
    {
      "name": "Phil de Valence",
      "title": "Principal Product Manager",
      "company": "Amazon Web Services"
    }
  ],
  "attributes": {
    "topic": "Migration & Modernization",
    "area_of_interest": [
      "Generative AI",
      "Innovation & Transformation",
      "Agentic AI"
    ],
    "services": [
      "AWS Transform",
      "Kiro"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=aq2OEssc-qM",
  "session_code": "MAM402",
  "duration_seconds": 3303,
  "duration_minutes": 55.0
}