{
  "title": "AWS re:Invent 2025 - How AWS and Next Gen Stats Redefine Football Intelligence",
  "title_cn": "AWS re:Invent 2025 - AWS与下一代统计数据如何重新定义橄榄球智能",
  "abstract": "This isn't just sports analytics—it's a masterclass in operating ML and AI at unprecedented scale. In 2015, the NFL and AWS launched Next Gen Stats, transforming how millions experience football. What began with simple sport metrics has evolved into sophisticated machine learning capturing the game's complexity—completion probability, expected yards, pressure prediction, and coverage responsibility.\n\nThis session marks 10 years of innovation through Then → Now → Next. Then: basic stats gave fans new vocabulary. Now: advanced ML models reveal hidden dimensions, powering broadcasts, player safety, and experiences like Toy Story Funday Football. Next: AWS is architecting football's AI-first future with predictive and generative capabilities at NFL scale.\n\nDiscover how AWS processes billions of data points for real-time insights and explore ML breakthroughs behind probability engines. ",
  "abstract_cn": "这不仅仅是体育分析——这是在前所未有的规模下运营机器学习和人工智能的大师课。2015年，NFL和AWS推出了Next Gen Stats，改变了数百万人体验橄榄球的方式。从简单的运动指标开始，已经演变为捕捉比赛复杂性的复杂机器学习——完成概率、预期码数、压力预测和防守责任。\n\n本次会议标志着10年的创新历程：过去→现在→未来。过去：基础统计数据为球迷提供了新的词汇。现在：先进的机器学习模型揭示了隐藏的维度，为广播、球员安全以及《玩具总动员趣味橄榄球日》等体验提供支持。未来：AWS正在以NFL规模构建橄榄球的AI优先未来，具备预测和生成能力。\n\n了解AWS如何处理数十亿数据点以获得实时洞察，并探索概率引擎背后的机器学习突破。",
  "presenter": [
    {
      "name": "Julie Souza",
      "title": "Global Head of Sports Strategy",
      "company": "Amazon Web Services"
    },
    {
      "name": "Mike Band",
      "title": "Sr. Manager, Next Gen Stats",
      "company": "NFL"
    },
    {
      "name": "Cynthia Frelund",
      "title": "NFL Network Analyst",
      "company": "National Football League"
    },
    {
      "name": "Greg Olsen",
      "title": "FOX Sports Analyst",
      "company": "FOX Sports"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Machine Learning"
    ],
    "services": [],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=AuhDja8b0O4",
  "session_code": "SPF103"
}