{
  "title": "AWS re:Invent 2025 - Building software like never before with Agentic AI (DVT220)",
  "title_cn": "AWS re:Invent 2025 - 使用智能体AI前所未有地构建软件 (DVT220)",
  "abstract": "Discover the future of software development as we explore the transformative power of agents with Amazon Bedrock AgentCore and Kiro’s spec-driven development in modernizing your entire software development lifecycle (SDLC). Agentic AI is impacting software development by automating tasks, improving efficiency, and enabling more autonomous workflows throughout the development lifecycle. It allows teams to go beyond simple code generation to handle project planning, designing, testing, documentation, building agents into workflows, and retiring technical debt. In this session, you'll also hear from Rackspace about their journey building with Kiro and the transformational impact it is having on their organization. Join us to explore how these powerful capabilities work together to help organizations accelerate from prototype to production ready applications.",
  "abstract_cn": "探索软件开发的未来，了解Amazon Bedrock AgentCore的代理和Kiro规范驱动开发的变革力量如何实现整个软件开发生命周期(SDLC)的现代化。代理AI正在通过自动化任务、提高效率以及在整个开发生命周期中实现更自主的工作流程来影响软件开发。它使团队能够超越简单的代码生成，处理项目规划、设计、测试、文档编写、将代理构建到工作流程中以及清除技术债务。在本次会议中，您还将听到Rackspace关于使用Kiro构建的历程以及其对组织产生的变革性影响。加入我们，探索这些强大功能如何协同工作，帮助组织加速从原型到生产就绪应用程序的过程。",
  "presenter": [
    {
      "name": "Al Destefano",
      "title": "Generative AI Specialist",
      "company": "AWS"
    },
    {
      "name": "Svetlana Kolomeyskaya",
      "title": "Head of Outbound GTM, Generative AI",
      "company": "Amazon Web Services"
    },
    {
      "name": "Brian Lichtle",
      "title": "CTO, IT",
      "company": "Rackspace Technology"
    }
  ],
  "attributes": {
    "topic": "Developer Tools",
    "area_of_interest": [
      "Agentic AI",
      "DevOps"
    ],
    "services": [
      "Kiro"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=Fer2DKJ2jNA",
  "session_code": "DVT220"
}