{
  "title": "AWS re:Invent 2025 - Scaling Accessibility w/ Agentic AI: Siteimprove + Amazon Bedrock & Nova-NTA202",
  "title_cn": "AWS re:Invent 2025 - 使用智能体AI扩展无障碍性：Siteimprove + Amazon Bedrock & Nova-NTA202",
  "abstract": "Discover how Siteimprove, a market-leader providing an agentic content intelligence platform for digital accessibility and content performance, harnesses Amazon Bedrock, Bedrock Agents and Nova to create accessible digital experiences. This session takes you from concept to production, showcasing how Siteimprove partnered with the AWS GenAI Innovation Center to scale accessibility assessments to millions of requests each month while improving accuracy and cutting costs. See how these advancements are helping customers deliver accessible, compliant, and user-friendly websites—expanding audience reach and meeting regulatory requirements with confidence. You’ll walk away with best practices for project planning, resource optimization, and agentic AI implementation, plus actionable strategies to scale your own AI-powered accessibility solutions on AWS—no matter your starting point. ",
  "abstract_cn": "了解Siteimprove这家提供代理内容智能平台的市场领导者如何利用Amazon Bedrock、Bedrock Agents和Nova来创建无障碍数字体验，该平台专注于数字无障碍和内容性能。本次会议将带您从概念到生产的全过程，展示Siteimprove如何与AWS GenAI创新中心合作，将无障碍评估扩展到每月数百万次请求，同时提高准确性并降低成本。了解这些进步如何帮助客户提供无障碍、合规且用户友好的网站——扩大受众覆盖范围并满足监管要求。您将学到项目规划、资源优化和代理AI实施的最佳实践，以及在AWS上扩展您自己的AI驱动无障碍解决方案的可行策略——无论您的起点如何。",
  "presenter": [
    {
      "name": "Sujal Shah",
      "title": "Sr. Customer Solutions Manager",
      "company": "Amazon"
    },
    {
      "name": "Pradeep Sridharan",
      "title": "Senior Solution Architect",
      "company": "Amazon Web Services"
    },
    {
      "name": "Hamed Shahir",
      "title": "Director of AI & Data Science",
      "company": "Siteimprove"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Generative AI"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon Nova"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=_gnj3ornavE",
  "session_code": "NTA202",
  "duration_seconds": 3506,
  "duration_minutes": 58.4
}