{
  "title": "AWS re:Invent 2025 - Moody’s: Architecting a multi-agent system on AWS (IND3303)",
  "title_cn": "AWS re:Invent 2025 - 穆迪：在AWS上构建多智能体系统架构 (IND3303)",
  "abstract": "Financial institutions need to orchestrate specialized analysis across diverse domains while maintaining regulatory compliance and performance at scale. Learn how Moody's built their Research Assistant using domain agents for ratings, climate, and economics; task agents for KYC screening and company credit assessment; and workflow agents for sales and marketing and portfolio monitoring with early warning signals on Amazon Bedrock. Explore architectural patterns for multi-agent coordination using Amazon DynamoDB, Amazon Aurora PostgreSQL, AWS Lambda, and Amazon ECS that accelerated insights by 60% and reduced task completion by 30%. Discover approaches to agent specialization and knowledge retrieval that ensure compliance while processing complex financial datasets.",
  "abstract_cn": "金融机构需要在保持监管合规性和大规模性能的同时，协调跨不同领域的专业化分析。了解穆迪如何使用Amazon Bedrock构建其研究助手，该助手采用评级、气候和经济学领域代理；KYC筛查和公司信用评估任务代理；以及销售营销和投资组合监控工作流代理，并提供早期预警信号。探索使用Amazon DynamoDB、Amazon Aurora PostgreSQL、AWS Lambda和Amazon ECS进行多代理协调的架构模式，这些模式将洞察速度提升了60%，任务完成时间减少了30%。发现代理专业化和知识检索方法，确保在处理复杂金融数据集时保持合规性。",
  "presenter": [
    {
      "name": "Samuel Baruffi",
      "title": "Principal Solutions Architect",
      "company": "Amazon Web Services (AWS)"
    },
    {
      "name": "Dennis Climent",
      "title": "Sr Dir Mgr-Software Eng",
      "company": "Moody's"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [
      "Well-Architected Framework",
      "Agentic AI",
      "Machine Learning"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon Elastic Container Service (Amazon ECS)",
      "Amazon OpenSearch Service"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=HC8jSzNmNpU",
  "session_code": "IND3303",
  "duration_seconds": 3484,
  "duration_minutes": 58.1
}