{
  "title": "AWS re:Invent 2025 - BCC: Hybrid architecture for generative AI to meet regulatory needs (HMC324)",
  "title_cn": "AWS re:Invent 2025 - BCC：满足监管需求的生成式AI混合架构 (HMC324)",
  "abstract": "Bank CenterCredit (BCC), a leading bank in Kazakhstan, developed the first secure, scalable hybrid architecture for generative AI tailored to meet Kazakhstan’s financial data regulations in Central Asia. Leveraging AWS Outposts and AWS KMS, the bank was able to locally store and anonymize sensitive data before sending it to the parent AWS Region for encrypted processing. This architecture created a solid foundation for multiple generative AI projects delivered with Amazon SageMaker and Amazon Bedrock. Use cases include a custom speech recognition model in Russian, Kazakh, and mixed languages and an HR chatbot. Join this session to learn how the hybrid cloud architecture enabled regulatory compliance, cost savings, and operational efficiency—positioning BCC for continued innovation and growth.",
  "abstract_cn": "哈萨克斯坦领先银行 Bank CenterCredit (BCC) 开发了首个安全、可扩展的生成式 AI 混合架构,专门满足哈萨克斯坦在中亚地区的金融数据法规要求。通过利用 AWS Outposts 和 AWS KMS,该银行能够在本地存储和匿名化敏感数据,然后将其发送到父 AWS 区域进行加密处理。这一架构为使用 Amazon SageMaker 和 Amazon Bedrock 交付的多个生成式 AI 项目奠定了坚实基础。应用案例包括支持俄语、哈萨克语和混合语言的定制语音识别模型,以及 HR 聊天机器人。参加本次会议,了解混合云架构如何实现合规性、成本节约和运营效率,为 BCC 的持续创新和增长奠定基础。",
  "presenter": [
    {
      "name": "Aleksandr Bernadskii",
      "title": "Senior Solutions Architect",
      "company": "Amazon Web Services"
    },
    {
      "name": "Maxim Geng",
      "title": "Senior DevOps Engineer",
      "company": "Bank CenterCredit"
    }
  ],
  "attributes": {
    "topic": "Hybrid Cloud & Multicloud",
    "area_of_interest": [
      "Digital Sovereignty",
      "Generative AI",
      "Governance, Risk & Compliance"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon SageMaker",
      "AWS Outposts"
    ],
    "type": "Lightning talk"
  },
  "video_url": "https://www.youtube.com/watch?v=dqHjRlZSVNM",
  "session_code": "HMC324"
}