{
  "title": "AWS re:Invent 2025 - Volkswagen Group's custom GenAI models for global brand consistency (SPS313)",
  "title_cn": "AWS re:Invent 2025 - 大众汽车集团的定制生成式AI模型用于全球品牌一致性 (SPS313)",
  "abstract": "Discover how Volkswagen Group, delivering 9.0 million vehicles annually across 115 global facilities, ensures brand consistency while scaling global marketing operations. Learn how VW transformed their marketing pipeline through two innovations: custom-finetuned image generation models creating on-brand visual content at scale, and pioneering work with Amazon Nova to automatically evaluate marketing assets against brand guidelines. As Nova's launch partner for customization, VW implemented preference tuning aligning AI with marketing experts' judgment. See how this intelligent system applies VW's unique brand standards across diverse markets, revolutionizing how a leading automaker maintains brand integrity while driving localized engagement.",
  "abstract_cn": "了解大众汽车集团如何在全球115个生产基地每年交付900万辆汽车的同时，确保品牌一致性并扩展全球营销运营。了解大众汽车如何通过两项创新改变其营销流程：定制微调的图像生成模型大规模创建符合品牌的视觉内容，以及与Amazon Nova开展开创性合作，根据品牌指南自动评估营销资产。作为Nova定制化的首发合作伙伴，大众汽车实施了偏好调优，使AI与营销专家的判断保持一致。了解这一智能系统如何在不同市场应用大众汽车独特的品牌标准，彻底改变这家领先汽车制造商在推动本地化参与的同时保持品牌完整性的方式。",
  "presenter": [
    {
      "name": "Liam Byrne",
      "title": "Data Scientist",
      "company": "Amazon Web Services (AWS)"
    },
    {
      "name": "Kim Robins",
      "title": "Senior Generative AI Strategist",
      "company": "Amazon Web Services"
    },
    {
      "name": "Sebastian Angersbach",
      "title": "Head of IT Service Strategy & Innovation",
      "company": "Volkswagen Group Services GmbH"
    }
  ],
  "attributes": {
    "topic": "Business Applications",
    "area_of_interest": [
      "Generative AI",
      "Innovation & Transformation"
    ],
    "services": [
      "Amazon Bedrock",
      "Amazon SageMaker",
      "Amazon Nova"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=mP93EX_rvRk",
  "session_code": "SPS313"
}