{
  "title": "AWS re:Invent 2025 - Automating IAM policy validation and analysis using GitHub Actions  (SEC341)",
  "title_cn": "AWS re:Invent 2025 - 使用 GitHub Actions 自动化 IAM 策略验证和分析 (SEC341)",
  "abstract": "In this code talk, we'll demonstrate how to automate the validation and analysis of AWS IAM policies using GitHub Actions and IAM Access Analyzer. Through live coding examples, you'll see how policy validation and analysis, powered by automated reasoning, can minimise deployment of unwanted IAM policies. While security teams oversee organizational security posture, developers create applications needing permissions. Watch as we code the solution for enabling developer speed with security through delegated IAM policy authoring. Through interactive demonstrations, you'll learn how cfn-policy-validator and GitHub Actions can automatically validate and analyze IAM policies to uphold security when permitting developers policy authoring abilities. Follow along with the code as we show you how to enable developer speed without compromising security posture.",
  "abstract_cn": "在这个代码演讲中，我们将演示如何使用GitHub Actions和IAM Access Analyzer自动化验证和分析AWS IAM策略。通过实时编码示例，您将看到由自动推理驱动的策略验证和分析如何最大限度地减少不需要的IAM策略的部署。虽然安全团队负责监督组织安全态势，但开发人员创建需要权限的应用程序。观看我们编写解决方案，通过委托IAM策略编写实现开发人员速度与安全性的平衡。通过交互式演示，您将学习cfn-policy-validator和GitHub Actions如何自动验证和分析IAM策略，在允许开发人员策略编写能力的同时维护安全性。跟随代码演示，我们将向您展示如何在不影响安全态势的情况下提高开发人员速度。",
  "presenter": [
    {
      "name": "Mitch Beaumont",
      "title": "Principal Solutions Architect",
      "company": "AWS"
    },
    {
      "name": "Nitin Kulkarni",
      "title": "Sr. Solutions Architect",
      "company": "AWS"
    }
  ],
  "attributes": {
    "topic": "Security & Identity",
    "area_of_interest": [
      "Application Security",
      "DevSecOps"
    ],
    "services": [
      "AWS IAM Identity Center",
      "AWS Identity and Access Management (IAM)"
    ],
    "type": "Code talk"
  },
  "video_url": "https://www.youtube.com/watch?v=77jWcqzlDNM",
  "session_code": "SEC341-R"
}