{
  "title": "AWS re:Invent 2025 - Building multi-Region data lakes with Replication for Amazon S3 Tables (STG358)",
  "title_cn": "AWS re:Invent 2025 - 使用 Amazon S3 Tables 复制功能构建多区域数据湖 (STG358)",
  "abstract": "Organizations running critical analytics on Apache Iceberg need multi-Region replication for compliance, business continuity, and global data sharing. However, replicating Iceberg tables requires maintaining snapshot chronology, rewriting metadata files, and coordinating multiple catalogs—complexity that goes far beyond simple object replication. Learn how Replication for S3 Tables provides managed, native replication for Iceberg tables across Regions and accounts with minimal effort, while preserving table integrity, snapshot history, and query performance. We cover architectural strategies for designing multi-Region data lakes, best practices for backup scenarios, and cost optimization. You’ll also hear from Zeta Global on how they use Replication for S3 Tables to reduce operational overhead and enhance their compliance posture.",
  "abstract_cn": "运行关键 Apache Iceberg 分析的组织需要多区域复制以满足合规性、业务连续性和全球数据共享需求。然而,复制 Iceberg 表需要维护快照时间顺序、重写元数据文件以及协调多个目录——这种复杂性远超简单的对象复制。了解 S3 Tables 复制功能如何以最小的工作量为跨区域和跨账户的 Iceberg 表提供托管的原生复制,同时保持表完整性、快照历史记录和查询性能。我们将介绍设计多区域数据湖的架构策略、备份场景的最佳实践以及成本优化。您还将了解 Zeta Global 如何使用 S3 Tables 复制功能来减少运营开销并增强其合规态势。",
  "presenter": [
    {
      "name": "Aritra Gupta",
      "title": "Sr. Product Manager - Technical",
      "company": "Amazon Web Services"
    },
    {
      "name": "Nikos Tsatsalmas",
      "title": "Sr. Software Dev Engineer",
      "company": "Amazon Web Services"
    },
    {
      "name": "Soumil Shah",
      "title": "Lead Software Engineer",
      "company": "Zeta Global"
    }
  ],
  "attributes": {
    "topic": "Storage",
    "area_of_interest": [
      "Disaster Response & Recovery",
      "Monitoring & Observability",
      "Well-Architected Framework"
    ],
    "services": [
      "Amazon CloudWatch",
      "Amazon Simple Storage Service (Amazon S3)"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=3aca3axKgGs",
  "session_code": "STG358"
}