{
  "title": "AWS re:Invent 2025 - Basketball's AI Revolution: How AWS and the NBA Are Changing the Game (SPF102)",
  "title_cn": "AWS re:Invent 2025 - 篮球的AI革命：AWS和NBA如何改变比赛 (SPF102)",
  "abstract": "The NBA is undergoing a digital revolution powered by AWS. This session explores how cloud computing, AI, and advanced analytics are transforming basketball—from fan engagement and personalized content to immersive viewing experiences and sophisticated game analytics.\n\nDiscover how Prime Video and the NBA harness AWS to deliver cutting-edge game analysis and revolutionary viewing options. Learn how cloud infrastructure enables real-time insights, predictive modeling, and AI-driven experiences that reshape how teams strategize, players develop, and millions of fans engage globally.\n\nThis isn't just basketball—it's operating advanced analytics and ML at global scale. The technical lessons apply across industries, from real-time platforms to personalized content delivery and production AI.\n\n\n\n",
  "abstract_cn": "NBA正在经历由AWS驱动的数字化革命。本次会议探讨云计算、人工智能和高级分析如何改变篮球运动——从球迷参与和个性化内容到沉浸式观看体验和复杂的比赛分析。\n\n了解Prime Video和NBA如何利用AWS提供前沿的比赛分析和革命性的观看选项。学习云基础设施如何实现实时洞察、预测建模和AI驱动的体验，重塑团队制定策略、球员发展以及全球数百万球迷参与的方式。\n\n这不仅仅是篮球——这是在全球规模上运营高级分析和机器学习。这些技术经验适用于各个行业，从实时平台到个性化内容交付和生产AI。",
  "presenter": [
    {
      "name": "Toby McAuliffe",
      "title": "Principal, Global Partnerships",
      "company": "Amazon Web Services"
    },
    {
      "name": "Kristin Shaff",
      "title": "Director, Marketing",
      "company": "Amazon Web Services"
    },
    {
      "name": "Christopher Benyarko",
      "title": "EVP DTC PTO",
      "company": "NBA"
    },
    {
      "name": "Andy Oh",
      "title": "Principal, Sports Partnerships",
      "company": "Amazon"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [],
    "services": [],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=pZczwGVzWxo",
  "session_code": "SPF102",
  "duration_seconds": 2290,
  "duration_minutes": 38.2
}