{
  "title": "AWS re:Invent 2025 - Capital One: Building resilient systems by engineering for five nines (IND3308)",
  "title_cn": "AWS re:Invent 2025 - Capital One：通过工程化实现五个九来构建弹性系统 (IND3308)",
  "abstract": "99.999% availability—less than five minutes of downtime per year—is the gold standard for mission-critical applications. This session dives deep into architectural strategies to achieve such availability using AWS. We'll explore fault-tolerant patterns such as multi-Region deployments, active-active failover, circuit breakers, bulkheads, chaos testing, and event-driven designs. Learn how services like Amazon S3, Amazon DynamoDB Global Tables, and AWS Lambda can eliminate single points of failure. We’ll cover SLAs, SLOs, and engineering observability and automation to detect and respond to failures within milliseconds. Case studies and practical design guidance make this session ideal for architects and engineers building for extreme reliability.\n",
  "abstract_cn": "99.999% 的可用性——每年停机时间少于五分钟——是关键任务应用程序的黄金标准。本次会议深入探讨使用 AWS 实现这种可用性的架构策略。我们将探索容错模式，如多区域部署、主动-主动故障转移、断路器、隔离舱、混沌测试和事件驱动设计。了解 Amazon S3、Amazon DynamoDB Global Tables 和 AWS Lambda 等服务如何消除单点故障。我们将介绍 SLA、SLO，以及工程可观测性和自动化，以便在毫秒内检测和响应故障。案例研究和实用设计指导使本次会议成为构建极致可靠性的架构师和工程师的理想选择。",
  "presenter": [
    {
      "name": "Enrique Bastante",
      "title": "Sr. Customer Solutions Manager, AWS Strategic Accounts",
      "company": "AWS"
    },
    {
      "name": "Arunkumar Ganesan",
      "title": "Distinguished Engineer",
      "company": "CapitalOne Financial Services LLC"
    },
    {
      "name": "Sobhan Mupparaju",
      "title": "Sr. Director Software Engineer",
      "company": "Capital One"
    }
  ],
  "attributes": {
    "topic": "Architecture",
    "area_of_interest": [],
    "services": [
      "Amazon DynamoDB",
      "Amazon Simple Storage Service (Amazon S3)",
      "AWS Lambda"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=aS8sqMUd5A8",
  "session_code": "IND3308"
}