{
  "title": "AWS re:Invent 2025 - The agent-enabled workplace: Transforming businesses with AI (INV203)",
  "title_cn": "AWS re:Invent 2025 - 智能体赋能的工作场所：用人工智能变革企业 (INV203)",
  "abstract": "Discover how organizations are transforming their businesses by truly making AI part of the team. Learn three key ways companies are putting AI to work today: revolutionizing business processes, reinventing the way individuals work and teams collaborate, and transforming customer experiences. We also explore how the future workplace will evolve as AI becomes an integral team member. Through real customer examples, see how users can work with an agentic teammate like Amazon Quick Suite to get the right answers to every question across all their data and transform answers into actions, and how Amazon Connect is creating customer experiences that make every interaction personal, effortless, and memorable. You’ll also learn how Amazon uses these technologies in our own business. Gain practical insights to deliver real business value with AI while maintaining enterprise-grade security and trust. Join us to learn how AWS is helping organizations transform their business with effective AI collaboration.",
  "abstract_cn": "了解组织如何通过真正让AI成为团队一员来转型其业务。学习企业当前应用AI的三种关键方式：革新业务流程、重塑个人工作和团队协作方式，以及转变客户体验。我们还将探讨随着AI成为不可或缺的团队成员，未来工作场所将如何演变。通过真实客户案例，了解用户如何与Amazon Quick Suite这样的智能体队友协作，从所有数据中获得每个问题的正确答案并将答案转化为行动，以及Amazon Connect如何创造让每次互动都个性化、轻松且令人难忘的客户体验。您还将了解Amazon如何在自身业务中使用这些技术。获取实用洞察，在保持企业级安全性和信任的同时，通过AI实现真正的业务价值。加入我们，了解AWS如何帮助组织通过有效的AI协作转型其业务。",
  "presenter": [
    {
      "name": "Pasquale DeMaio",
      "title": "Vice President",
      "company": "AWS"
    },
    {
      "name": "Jose Kunnackal John",
      "title": "Director Core BI, QuickSight",
      "company": "Amazon AWS"
    },
    {
      "name": "Sean Huberty",
      "title": "Vice President, Customer Care",
      "company": "Priceline"
    },
    {
      "name": "Celine Laurent-Winter",
      "title": "Vice President Connected Vehicle Platforms",
      "company": "BMW AG"
    },
    {
      "name": "Nithin Ramachandran",
      "title": "Vice President - Data, Analytics & AI",
      "company": "3M"
    },
    {
      "name": "Vaishali Goyal",
      "title": "Senior Director R&D IT",
      "company": "Astra Zeneca"
    }
  ],
  "attributes": {
    "topic": "Artificial Intelligence",
    "area_of_interest": [],
    "services": [],
    "type": "Innovation talk"
  },
  "video_url": "https://www.youtube.com/watch?v=qHvm3oFmRls",
  "session_code": "INV203"
}