{
  "title": "AWS re:Invent 2025 - IAM Access Analyzer Deep Dive: From Configuration to Remediation (SEC340)",
  "title_cn": "AWS re:Invent 2025 - IAM Access Analyzer 深度解析：从配置到修复 (SEC340)",
  "abstract": "Dive deep into IAM Access Analyzer in this interactive code talk focused on enhancing your AWS security posture. Watch and code along as we explore the automated reasoning powers of the three key analyzers: Unused Access, External Access, and Internal Access. Through live coding demonstrations, you'll learn how to configure each analyzer and interpret their findings. We'll guide you through actionable recommendations and specific remediation steps for common issues identified by these tools, showing the actual code implementation. By the end of this code talk, you'll be equipped with the knowledge to effectively implement IAM Access Analyzer in your own environment, enabling you to proactively identify and address potential security risks, optimize access management, and maintain a robust security stance in your AWS infrastructure.",
  "abstract_cn": "在这个以增强AWS安全态势为重点的交互式代码讲座中深入探讨IAM Access Analyzer。观看并跟随我们一起编码，探索三个关键分析器的自动推理能力：未使用访问、外部访问和内部访问。通过实时编码演示，您将学习如何配置每个分析器并解读其发现结果。我们将指导您完成可操作的建议和这些工具识别的常见问题的具体修复步骤，展示实际的代码实现。在本次代码讲座结束时，您将具备在自己的环境中有效实施IAM Access Analyzer的知识，使您能够主动识别和解决潜在的安全风险，优化访问管理，并在AWS基础设施中保持强大的安全态势。",
  "presenter": [
    {
      "name": "Mitch Beaumont",
      "title": "Principal Solutions Architect",
      "company": "AWS"
    },
    {
      "name": "Jeremiah Dunham",
      "title": "Senior Software Development Manager",
      "company": "Amazon Web Services"
    }
  ],
  "attributes": {
    "topic": "Security & Identity",
    "area_of_interest": [
      "DevSecOps",
      "Identity & Access Management"
    ],
    "services": [
      "AWS CloudTrail",
      "AWS IAM Identity Center",
      "AWS Identity and Access Management (IAM)"
    ],
    "type": "Code talk"
  },
  "video_url": "https://www.youtube.com/watch?v=vYXunsSxeR4",
  "session_code": "SEC340"
}