{
  "title": "AWS re:Invent 2025 - Scale and Optimize your Solutions Globally with AWS Expansion Programs (ISV317)",
  "title_cn": "AWS re:Invent 2025 - 通过AWS扩展计划在全球范围内扩展和优化您的解决方案 (ISV317)",
  "abstract": "This comprehensive session reveals how to build, scale, and optimize your software solutions globally through powerful integrations. Through technical deep-dives and real-world case studies, AWS ISV builders will share practical insights on Navigating regional compliance and regulatory requirements, implementing market-specific customizations, optimizing costs across different geographical deployments, Building resilient multi-region architectures. Whether you're a startup planning your first international move or an established ISV expanding into new markets, discover how AWS's Global Passport Program provides the tools, resources, and expertise to support your global growth journey while maintaining operational excellence and innovation at scale",
  "abstract_cn": "本综合会议揭示了如何通过强大的集成在全球范围内构建、扩展和优化您的软件解决方案。通过技术深入探讨和真实案例研究，AWS ISV 构建者将分享关于以下方面的实用见解：应对区域合规性和监管要求、实施特定市场的定制化、优化不同地理部署的成本、构建弹性多区域架构。无论您是计划首次国际化的初创公司，还是正在拓展新市场的成熟 ISV，都可以了解 AWS 全球护照计划如何提供工具、资源和专业知识，以支持您的全球增长之旅，同时保持卓越运营和大规模创新。",
  "presenter": [
    {
      "name": "Jeff Klaus",
      "title": "Global ISV Strategy",
      "company": "Amazon"
    },
    {
      "name": "Max Admoni",
      "title": "Sr. Director, Global Partnerships",
      "company": "Riskified"
    },
    {
      "name": "Francesca Bowen",
      "title": "Global VP, Strategic Alliances",
      "company": "Darktrace"
    },
    {
      "name": "Paul Peterson",
      "title": "Global Offering Manager New Regions and Regulated Markets",
      "company": "Qlik"
    }
  ],
  "attributes": {
    "topic": "Security & Identity",
    "area_of_interest": [
      "Digital Sovereignty",
      "Global Infrastructure"
    ],
    "services": [
      "AWS Global Accelerator"
    ],
    "type": "Breakout session"
  },
  "video_url": "https://www.youtube.com/watch?v=YaX30EKRzco",
  "session_code": "ISV317"
}